[{"title":"应用软件项目管理考点","date":"2019-01-20T15:05:00.000Z","path":"2019/01/20/期末复习/应用软件项目管理/应用软件项目管理考点/","text":"General characteristics of a projectA project is a temporary endeavour undertaken to create a unique product or service. It is specific, timely, usually multidisciplinary, and always conflict ridden. Projects are parts of overall programs and may be broken down into tasks, subtasks, and further if desired. Vary in size Vary in type Have desired completion dates Requires various kinds of knowledge Requires domain knowledge Requires team work Requires responsibilities and authorities Do not exist in isolation General management vs. Project management General management Organizational management Portfolio management Program management Not time limited? No completion dates? No managerial hierarchy? Routine activities Annual budgeting Project management Project management is the application of knowledge, skills, tools, and techniques to project activities to meet the project requirements Five categories of activities Initiating Planning Executing Monitoring and Controlling Closing How does the world look like? Uncertainty Plans go awry Even the closest future is unpredictable Chance events occur frequently The life is a rough road We need to do trade-offs every day We constantly negotiate We need flexibility Manage uncertaintiesRisk management “Project management is risk management” Identify potential problems before they occur Put preventive actions in place before unrecoverable harm occurs Risks – possible events that may affect the project negatively Problems – events that have or will affect the project negatively Stages in risk management: Risk identification; project, product and business risks Risk analysis; probability and consequences, triggers Risk planning; how to address risks – eliminate, reduce, ignore Risk monitoring; controlling and updating the risks Risk reporting Matrix Decision matrix Gantt chart Strategic Plan for New Business RACI matrix Usually derived from the WBS Clarify responsibilities RACI Responsible, who is responsible for actually doing the activity RACI Accountable, who is accountable for the completion of the task RACI Consult, who should be consulted RACI Informed, who must be informed Note that combinations may exist, e.g. AR, CI, AC Example Critical path A path from the projects start event to its finish event that, if delayed, will delay the completion date Brainstorming Sprint, Sprint backlog Sprint A fixed period of time, usually 2 or 3 weeks but can be more Always use the same fixed period The development team should have full authority during the sprint The Sprint goal must be defined in advance The team can change (the depth of) the functionality of the Sprint, as long as it meets its sprint goal Product backlog Requirements gathering for the Product Backlog Identify the stakeholders and their goals Identify the different categories of stakeholders Ask the question: “Why do you need this?” What are the business objectives and goals? How do we measure goal accomplishment? The goals shall be SMART: Specific Measurable Acceptable Realistic Time-based Gather requirements for the Product Backlog Meet the stakeholders Understand the stakeholders needs Use the “Tree and Forest” analogy Identify the trees, branches and leaves Use a top down approach mixed with bottom-up? The leaves may be user stories Group the leaves into branches Group the branches into trees Verify the stories with the stakeholders The CUTFIT rules Validate the user stories Consistent no conflict between user stories Unambiguous one interpretation Testable test cases can be created Feasible possible to implement Independent independent of other user stories Traceable you can link the story to the project goals Do not write stories endlessly. You can stop when you cannot decompose anymore or when you can derive tasks with working effort of approximately one day Product Backlog Item (PBI), example Scrum board Some thoughts about the Backlog Scrum in action recommends items to be stories (branches) Frequently, in practice, it seems to be a mix of stories, features, functions, tasks, improvements and incidents If you choose stories, you should consider defining tasks (leaves) in the stories The tasks should be transferred to activities in the sprint planning CommunicationBurndown charts &amp; EVM methodEarned Value Method - EVM Negative schedule, negative cost Positive schedule, negative cost Negative schedule, positive cost Positive schedule, positive cost Trend projection - EV Agile and Scrum tracking Release tracking Tracking story progress Release burndown chart Sprint tracking Tracking task progress Sprint burndown chart Release burndown chart Release burndown chart Release burndown chart Burndown charts Displays the remaining effort for a given period of time Do have good value for the stakeholders and the team Visualization is a good thing to do Conversation starters Over time it will give you the average number of points for a sprint You will learn the teams velocity You need to have a clear definition of done (DoD) Sprint burndown chart Burndown charts X axis displays working days Y axis displays remaining effort Ideal effort is (may be) a good guideline Consists of real progress of effort Put # of hours (story points) at the Y axis If backlog items are added to the sprint Scrum team Why is Scrum effective? Systematic reduction of problems and risks A leaner software development cycle More adaptive process People´s motivation and pride are in focus Monitoring and Controlling Determine the current status of the project schedule Influencing the factors that create schedule changes Determining if the project schedule has changed Managing the actual changes as they occur Monitoring All parties, stakeholders and others, must have available the information required to exercise control over the project An effective information system is needed Automated and manual Collection, recording and reporting project information Activities and performance need to be monitored Controlling Uses monitored data and information to bring actual performance into agreement with the plan Do we have the right information? How shall we interpret the information? How to balance into decisions? Without control there would be confusion, scope risks and conflict among stakeholders Chaos could be the norm of the project Monitoring and Controlling are easily treated together Execute plan - Design the monitoring system Identify characteristics of scope, time and cost Identify the goals, the objectives Define the boundaries when do we need to take action? Thresholds. Monitor progress against the sub-goals (e.g. milestones, sprint goals) Define data gathering mechanisms Define communication plan Measure activities, but always measure against RESULTS Define the system before-hand, up front Obtain results Decide on the data format Frequency, e.g. occurrence of event Raw numbers, actual amount Subjective numeric ratings, estimates, ranking Indicators, indirect measures Verbal characterization, team spirit, soft issues, feelings Collect data Decide on how to collect the defined data. More easily and preferably automated. Analyse results Analyse BEFORE reporting Simple aggregation can be done Compare with the planned results Averages, summaries, medians, trends Examples Number of activities done/left Actual cost/remaining cost Number of bugs per unit Performance or velocity You should use data for discovering, and as input for decision making Identify variance and Analyse results Identify deviations from the plan Variances can lead to severe problems The goal is to identify variances as early as possible Use plots, bars, lines, dots, etc. for analyzing trends (more later) Compare the variances towards the planned (allowed) variances Variances Acceptable – continue to monitor Unacceptable – additional action is required Consult personnel Consult expertise Could it generate more problems? Any additional risks? Call for meeting, analyze in groups Identify root cause and consider options Do not immediately adopt the first identified solution Try to find the optimal solution Analyse side-effects to the different solutions Resources needed? Cost? Time? Need help/decisions from sponsor/stakeholders? Corrective action and implementation Decide on corrective actions Review options Define success measures if possible Make choices of actions Who decide? Implement How will it be implemented? By whom? When? Who is responsible? Analyse the results Analyse the results of the corrective actions Compare against the defined measurements If unacceptable result then go to root cause analysis (again) If acceptable close the problem and store into lessons learned Repository of Lessons Learned: Take care of your Best Practices Avoid the situation from re-occurring Reporting Different kinds of reports Status reports Progress reports Forecast report Time/Cost report Variance report Presentations Demos SWOT analysis Strengths and Weaknesses Internal factors Human factors Finances Organisational factors Physical resources Experiences and knowledge Opportunities and Threats Trends New research Funding Competitors Competence Channels (marketing) SWOT analysis Prioritize elements in the analysis Define possible activities Analyse if it is feasible Decide on further management and activities Close down strategic direction if found necessary Keep the SWOT-analysis continuously updated Focus on the prioritized elements Stakeholder Management Definition of the term stakeholder: An individual A group An organisation who may affect, be affected by, or perceive itself to be affected by a decision, activity, or outcome of a project. Project governance the alignment of the project stakeholders´ needs or objectives Stakeholder can be The sponsor, the one who provides the resources and support Customers and users persons or organisations that will approve and manage the project´s product, service or result. Sellers provides components or services necessary for the project Business partners provides special expertise, e.g. installation, training, support. Example Organizational groups internal groups affected by the project activities Functional managers human resource, financial, accounting, procurement, IT Other stakeholders government experts, subject matter experts, consultants, Project Cost estimation Budgeting the project Must (always) be approved by management Resources must be allocated based on the estimations Should be connected to the vision and goals Should be supporting to the portfolio and program management Upper management is always (?) relating the project success to its relation to the approved budget Budgeting the project, necessities Shall always be related to the stakeholder requirements You need to have an idea of which resources you have Correct data must be collected Timely reporting Strong focus on resource and cost predictions Confirm approval of changes Consider always changed cost predictions when decisions are taken Consider changed cost predictions when problems occur Estimate changed cost predictions if risks become problems Forecasting What resources will be needed? How much resources will be needed? When will they be needed? How much will the resources cost? The resource cost can be differentiated by Unit, role Individual, level of competence or salary Need to consider Unit (hours, days, weeks, money,…) Level of precision (round up or down) Level of accuracy (range) Links to backlog and stories Threshold (agreed variations, if any) Performance measurement (earned value or story points left) Cost estimation tools and techniques Expert judgment Analogous estimation Parametric estimation Top-Down estimating Bottom-Up estimating Three-Point estimating Group-decision techniques Wide-band Delphi technique User story &amp; story points User story A story is a feature a bit of functionality with some characteristics (non-functional characteristics) Keep the stories simple and as short as possible A story is an agreement between the customer and the supplier It must provide some value to the customer Stories should be independent of each other Stories must be testable Examples As a power user, I can specify files or folders to backup based on file size, date created and date modified. As a user, I can indicate folders not to backup so that my backup drive isn’t filled up with things I don’t need saved. As a consumer, I want shopping cart functionality to easily purchase items online. Agile and Scrum Agile and Scrum Agile volatile, easy to move, easy to change Scrum start the game over again. Was originally launched as a contrast to plan-driven development The goal is: To produce software more effectively Embrace change Embrace change quickly! The change towards agile is not easy You need to have the organization with you See change as something positive You need to change your mind-set Scrum is a risk reduction mechanism a leaner software process a more adaptive software project management process A framework based on a team´s self-organization, motivation, ownership and pride. Scrum master Ensuring that Scrum values, practices and rules are used Represents the management and the team to each other Guide and coach the team towards achieving the goals Should protect the team towards outside disturbances Support in keeping track of progress Organize retrospectives to help the team and the organization to learn how to be more effective Enforces immediate decisions needed 7 qualities In-depth theoretical and practical knowledge about Scrum Great servant-leadership ability Strong organizational skills Great communication skills Excellent presentation skills Conflict resolution skills Great human development skills Product Owner Guards the product vision Ensure the fulfilment of goals Focus is on delivering business values and results The dependence of a good product owner is high The focus is to control the backlog by working with the stakeholders identified Gather requirements for the backlog Solely controls the backlog Collaborate with the team and the scrum master to do release planning Guide and support the team Keeps himself/herself updated with project progress Are available to the team, give the team feedback Is one person, not a team 7 qualities Know how to manage stakeholder´s expectations and sometimes their conflicting priorities Have a clear vision and knowledge of the product Know how to gather the requirements and turn them into a good product backlog Be available for the team Know how to be a good organizer Know how to communicate better than the average person Knows that it is all about servant leadership The Development Team, the Scrum team Self-managed and self-organized Estimate backlog items, stories Turns items, stories into tasks to work on in the Sprints Commits to the sprint goals Keeps track of progress Responsible for Sprint demos The team should solve their internal problems by themselves The team should be small, 7 +- 2 persons Minimize communication interfaces Teams should be cross-functional, including different capabilities Open work environments are to be preferred Line manager Line management vs. Project management | Line management | Project management || ———————————————– | ———————————————- || Managing status quo | Overseeing change || Consistent set of tasks | Changing set of tasks || Responsibility limited to own function | Responsibility for cross-functional activities || Permanent structures | Temporary structures || Maintenance tasks | Innovative tasks || Main task is optimization | Main task is resolution || Success related to achievement of interim tasks | Success related by achievement of end-goals || Limited set of variables | Contains a lot of uncertainties | Agile Manifesto Individuals and interactions——over processes and tools Working software——over comprehensive documentation Customer collaboration——over contract negotiation Responding to change——over following a plan Daily Scrum meetings Where the team communicates Approximately 15 minutes, short meetings Stand-up meeting Focus on three things: What has been done since the previous meeting? What are we going to do? What risks and problems exists? Removing obstacles Making necessary decisions Leadership style, Situational leadership styleProject Manager The person assigned by the performing organization to lead the team that is responsible for achieving the project objectives Interpersonal skills needed Leadership Team building Motivation Communication Influencing Decision making Political (company and business) awareness Cultural awareness Negotiation Trust building Conflict (healthy and unhealthy) management Coaching Project evaluation","tags":[{"name":"BTH","slug":"BTH","permalink":"https://zjxjwxk.com/tags/BTH/"},{"name":"期末复习","slug":"期末复习","permalink":"https://zjxjwxk.com/tags/期末复习/"}]},{"title":"团队合作与职业规划考点","date":"2019-01-19T14:01:00.000Z","path":"2019/01/19/期末复习/团队合作与职业规划/团队合作与职业规划考点/","text":"1. Career decision making cycle Know the elementsCommunication, Analysis, Synthesis, Valuing, Execution Know the definitionCommunication: Identifying the gap Analysis: Thinking about alternatives Synthesis: Creating likely alternatives Valuing: Prioritizing alternatives Execution: Taking action to narrow the gap Be able to elaborate the elementsCommunication: • Become aware of the gap• Discomfort, not so much fear of change• Seek assistance if needed• Emotions Analysis: • Clarify your knowledge• Clarify gap• Understand how you make decisions• Understand what influences you• What do you want?• What have you learned?• What are your values, interests and skills?• Do you want to take responsibility?• Self-awareness Synthesis: • Solve the gap• Avoid missing alternatives• Reduce to a manageable amount of options.• Brainstorm and reduce. Valuing: • Judge the benefit (and cost)• Rank• What´s the best choice?• Select an option Execution: • Convert decisions into action • Formulate a goal and a plan • Execute the plan • Plan, try, evaluate 2. Describe forces that affect our career The world is rapidly changing The economy goes up and down New companies emerges Some companies close down Unemployment goes up and down Organizational failures appears sometimes 3. Career planning vs. workforce planning Career development What the individuals in the organization do in order to ensure their interests and future Workforce planning What the organization does in order to ensure growth and profit 4. Activities to find employers Business/Industry Government Education Non-profit Private 5.The elements of a job campaign, describe and elaborate Gain Experience Create Connections First Impressions Count Be Professional Be Prepared and Persistent Be Realistic, Open-minded and Flexible 6. Elements and recommendations for writing a CV Elements Identification Career objective Education/Training Experience Other categories as appropriate References Recommendations Be brief Be consistent Be positive Be honest Be neat 7. Know basic elements for good communication Treat others as you would like to be treated yourself 8.The typical team, as defined by Brown Designers Managers Subject Matter Experts Stakeholders 9. The three values of the glue of a team Respect Humility Empathy 10. Be able to distinguish between assignment and commitment Assignments Assignments should be commitments Pressure to deliver Requirements to perform The expected result The expected cost Within the expected time frame Normally, these three items are pushed to its limits Commitment Should be voluntarily Deadlines, delivery dates should be defined Should be specific, clearly defined Clearly motivated Admit problems and risks Practice commitment culture 11. Mindset defined (Perception, Attitude, Disposition) Perception– How to interpret thing Attitude– How to react Disposition– Decide course of action, what to do 12. Different mindsets 13. Active listening Active listening Understanding Acknowledge Encourage Elaborate Hear others ideas See others ideas 14. Types of listening Prepare – Get ready Pause – Give time for speaking Probe – Let people elaborate Paraphrase/re-phrase – Summarize – Repeat – Confirm 15. Three obstacles to listening Short-circuiting Closed doors Embattled egos 16. Browns definition of conflictConflict is the way teams come to a shared understanding of each decision made in the process 17. Origins to conflicts• Differences in objectives• Different opinions• Different values• Argumentation and friction are unavoidable• Negotiations with the customer• Argumentation within the project organization• Different or changed priorities 18. Positive consequences of conflicts Produces better ideas Forces people to search for new approaches Causes problems to surface Forces clarification Stimulates interest and creativity An opportunity for people to test capacities 20. Shared understanding21. Obstacles to shared understanding Unclear goals Unclear process, directions Unknown constraints Personal disagreements Misconception Ego Disinterest 22. Healthy and unhealthy conflicts Unhealthy conflict A mask for– Not understanding– Not knowing– Anxiety for the decision– Personal conflicts 23. Root causes to conflicts External Four types of tensions– Disconnectedness– Exclusion– Misdirection– Ambiguity Internal Method conflict – Different ways of interpreting the method – HOW things are to be done– Different criteria for success– Re-do things– Adapt and tailor the method– Could be hidden by an outcome conflict– Usually it is healthy, it progresses work Outcome conflict – “The content of a decision”– Product outcomes – how the product look like– Poor performance – how to work– How to structure (Plan) the project– Purpose conflict – Why is this done?– Lack of decisions, lack of clarity 24. Know the five principles of behaviour patterns There is no single right answer Patterns may introduce new approaches Not every pattern works in every situation Several patterns may give the same result Patterns that are experienced as comfortable may be your favourite patterns 25. The four types of patterns to solve root causes of conflicts• Empathize​ – Break down misunderstandings – shared understanding​ – Let a neutral person take notes• Involve​ – To get more involvement​ – Story telling. Could use neutral persons• Redirect​ – Find focus, narrow the scope, take baby steps• Reframe​ – Use different words, find other approaches 26. The definition of collaboration• Collaboration means “working together” according to the dictionary• In software projects it also includes “producing something” 27. Collaboration vs. Groupthink Collaboration Working together Groupthink When you agree rather than come up with something better Collaboration should lead to groupthink 28. Aspects of collaboration Tools The tools have different focusTools helps in sharing and collaborationSoftware tools for– Messages– Chats– Video Mindset Perception– How to interpret thing Attitude– How to react Disposition– Decide course of action, what to do Culture • Open workspaces or closed rooms?• Dislike in some way of communicating• Against or for face-to-face communication• Organizational limitations and boundaries• Competition between people• Heading for a promotion? 29. The four virtues of collaboration1. Clarity and Definition 2. Accountability and Ownership 3. Awareness and Respect 4. Openness and Honesty situations example interpretation pattern design ignorance “I don’t see why we even need to spend time on this.”我不知道为什么我们要浪费时间做这个 Designers sometimes find themselves defending the practice of design itself. reflect the position(考虑他的位置); anticipate agendas; communicate implications 讨论影响（如果..会..?） Distracted by internal competition内部矛盾 “The marketing team is setting up their own Web site.” Members of the project team lose focus on project objectives because they are distracted by a competitor Help me prioritize; Fame the conversition; Recount previous conversation Distracted by shiny objects（consequence of distraction） “Our site needs social sharing functions.” “Shiny objects” is one term for ideas or technologies or techniques that have captured the imagination of the public or the industry. make it real; hold a workshop; offer alternatives(做一些 mock-up来比较) Don’t know what we need “What do you think we should do?” Without a clear definition of the design problem, the project team may run in different directions. provide starting points; set reasonable expectations; make assumption; Efforts ignored “This stuff doesn’t really matter because we’re working on a separate track.” 利益相关者或其他成员选择忽视outputs, recommendations, and solutions provided by people assigned to those activities. convert failure to action; help me help you; blame a “bad cop” Excluded from planning “It’s a shame she’s not in the meeting. All these action items are for her.” In this situation, the people responsible for delivering and executing are not included in the planning process. acknowledge achievements; communicate implications; reduce the assignment False consensus “I think we all agree here.” 大家都认为已经达到共识了，但仔细想想其实没有 In this situation the team comes to some agreement (on direction or approach, for example) but doesn’t re ask for a story; communicate implications; help me make this better(说出有挑战的点) Inconsistent expectations “That’s not what I said!” From one conversation to the next, team members change their expectations. Blame a “bad cop”; make it real; set reasonable expectations Insufficient progress 项目进度很慢，和懒惰有关 “You’ve done how much?” assigned tasks remain incomplete, design problems remain unsolved, or feedback isn’t fully incorporated. Go back to basics; Reduce the assignment; set reasonable expectations Irrelevant (无关紧要的)comparisons “Have you seen this Web site?” someone contributes comparative examples with little or no practical relevance to the design problem consider micro/macro perspectives; help me prioritize指出哪里相关; communicate implications Lack of clear inputs “Mmm… yeah… we’re not going to have the budget to do user research.” Designers don’t have detailed inputs (requirements, starting points, etc.) to frame the problem and inform the solution. Make a plan; Make it real; Make assumptions Lack of context “There’s a lot going on behind the scenes here…” Teams do not have insight into the organizational, business, or operational context surrounding a project. Pick one thing; Help me help you; List assumptions Lack of decision maker “So, what does the group think?” Design decisions drag out because no authority is capable of rendering executive decisions when necessary. anticipate agendas; hold a workshop; communicate implications Lack of stable strategy “So, things have changed since we last spoke…” the project’s objectives, parameters, or constraints change regularly. make assumption一些原则; blame a “bad cop”制定deadline; treat it like a project Late-breaking requirements “Now that I think about it, we’re also going to need…” the stakeholder who didn’t have time to participate in the process; the one thing that one guy forgot; a change to the business that has a ripple effect throughout all the company’s systems. Help me prioritize; make it real; make a plan Misinterpretation of tone “Your email was really snippy.” breeds hostility(敌意) or disrespect in the communications. Change the channel; reflect the position; come back later New perspectives “I know I’m coming in with this late, but…” stakeholders offering new perspectives may not welcome their positions being hastily dismissed.(立场被驳回) assert your process; frame the conversation(和利益相关者建立谈话); offer alternatives（提供更多的选择） No plan “OK, so what do we do next?” In this situation, the project lacks a plan that defines desired outcomes, activities, schedule, and assignments. Blame a “bad cop”; draw pictures; offer alternatives No time to design “Just get some rough ideas down by tomorrow, OK?” Forces outside the design team establish an unreasonable schedule for producing design ideas assert your process(坚持自己，说完不成); help me help you; set reasonable expectations Not a team player 拒绝和别人合作 “I can take care of this.” Someone on the team refuses to engage with other members Ask for help; Go back to basic; communicate implications Overpreparation认为已经解决了问题 “I think we’ve got the solution already.” Product teams may create early mock-ups to frame the problem, which locks them into a particular way of thinking about the problem. Hold a workshop; ask questions; ask for a story Poorly composed feedback “That just doesn’t look right to me.” The team receives feedback that doesn’t clearly articulate the next steps, the desired improvements, or the issues with the current version. Frame the conversation; take baby steps(go through the design point by point); change the metaphor Poorly planned presentation or discussion “I hate to put you on the spot, but…” Project stakeholders do not understand the design work because the design team hasn’t assembled a meaningful narrative set reasonable expectations; assert your process; ask questions Reluctant participation in design activities (一些人不积极参与design) “I’ll leave the drawing to my colleagues.” Some members of the team may not actively participate in creative games and brainstorming activities. provide starting points; assert your process; communicate implications Responses not timely “[This quote intentionally left blank.]” provide starting points; assert your process; communicate implications(和25pattern一样) Separated from key stakeholders “Let me take this to the VP, and I’ll let you know what she says.” Designers find themselves separated from the true client or customer through layers of bureaucracy. Hold a workshop; assert your process; take baby steps Tasks and goals not aligned “Everyone says we need to hold a daylong brainstorming session.” Designers sometimes engage in design activities with no real rationale. Such activities yield outcomes that likely don’t move the project forward, or do so inefficiently. set expectations; ask for the first step; make a plan Uncoordinated collaboration “So, which one of us is doing this?”(分配任务) Some project teams have no plan, no overall direction of where they’re going long-term and the activities required to get there. Take responsibility; provide starting points; enumerate issues Unfounded design direction（毫无根据的设计方向） “Hey, I did some mock-ups!” Someone outside the design team prepares screen designs, concepts, or other artifacts attempting to establish a creative direction. When a non-designer shows up with design artifacts, the team may feel tension because it implies lack of performance from the designers. Ask questions; take responsibility; acknowledge achievements Unreasonable constraints “I want the design to look the same on every Web browser.” Designers thrive on constraints: boundaries help designers understand what constitutes a good solution for the challenge. Some projects, however, are bounded by constraints that are arbitrary. consider micro/macro perspectives; help me prioritize; make it real Wrong scope “What do you mean I wasn’t supposed to work on that?” A designer works on the wrong thing. Take responsibility; acknowledge achievements; Go back to basics pattern Acknowledge achievements（involve “Wow, you guys did a great job on this. I can see the effort you put in. Can you walk me through to make sure I understand everything?” Engaging with someone about his or her work, and potentially balancing achievements with opportunities for improvement. Anticipate agendas（empathize “I know there are a few things that are especially important to you, so I wanted to address them right away.” Imagine what’s important to other members of the team or project stakeholders before engaging in a discussion with them. Entering a conversation with people expected to be competitive or confrontational, to demonstrate that you have their best interest in mind. ask for a story（reframe Ask someone to describe their ideas or thoughts or needs in the form of a story. Someone struggles to articulate their needs in the abstract, and you want to help them make it more concrete. ask for help（involve Directly ask someone to help you with your task. You need help. You’re preoccupied with proving yourself instead of solving the design problem. ask for the first step(Reframe) Ask someone what their first step will be in attempting to achieve an objective. Someone struggles to articulate their process for performing a task, by getting them to focus only on a small slice. ask questions(Reframe,Involve) Instead of jumping to conclusions, ask questions to make sure both you and the other people understand what’s going on. All. The. Time. No other skill is as essential to designers as being able to ask good questions. Except, perhaps, listening to the answers. assert your process(redirect) Remind participants of the schedule and the process on which it is based, providing lots of detail about activities, outcomes, and goals. Someone introduces factors that may compromise or derail the process, like late-breaking requirements. Blame a “bad cop”(reframe) Use another team member (not present) as a scapegoat. By putting a human face on the situation, people might work harder to find a compromise, or might forgive ignorance. Facing unreasonable constraints or being put on the spot for a question you can’t answer immediately. Call their bluff(揭发底牌) reframe Take a challenge to its inevitable conclusion and hold everyone involved accountable for meeting the challenge. Help other team members understand the impact of their request. Presented with unreasonable requests that aim to put pressure on the design team without any meaningful outcome. Capture lessons learned（involve，redirect） Make a list of issues, obstacles, and difficulties that came out of a prior project or situation or challenge. The project team hasn’t taken a moment to reflect on their previous work and how they could have done it better. change the channel（email，voice，etc）（reframe Find a different “channel” in which to communicate. Sometimes this means moving from email to voice, or in person to email, or instant messenger to video chat. Sometimes this means taking a conversation out of a public venue. The medium of communications is impacting participants’ ability to express themselves clearly. Change the metaphor（reframe） Use a different concept to explore or explain a complex idea. Participants become fixated on the metaphor and not the problem being solved, or when participants need a new way of looking at the same old problem. Channel your colleagues’ best qualities（redirect ，想想一个能处理好这件事的人。考虑他们将如何表现,并试图将其融入到情况。 Confronting a situation that is causing you particular anxiety or frustration. Sometimes, pretending to be a different person allows us to tap into not only their capabilities, but also their strength. come back later（Empathize, Redirect Postpone(延期) taking action until participants can consider the situation more deliberately. The situation has gotten out of hand, such that the participants aren’t providing reasonable and appropriate contributions Communicate implications（reframe “If we don’t get feedback until next week, we’ll have to shift our delivery milestones. Without feedback, I’m worried that we’ll have more work later in the project dealing with late-breaking requirements.” State, in the simplest terms possible, the consequences of a decision Participants make decisions without realizing the negative consequences for the process or project outcome. Consider micro/macro perspectives（redirect Look at the situation from two different angles, broad versus narrow or high versus low. Adopting a new perspective can help expose new issues and solutions. Participants become so focused on one perspective that they lose sight of the project or task objectives Consider your work/their work（reframe Offer encouragement and deflate the anxiety of critique by reminding colleagues that stakeholders and other team members are just doing their jobs. Confrontations have escalated to the extent that participants are having trouble hearing each other’s concerns Convert failure to action（redirect Take outcomes that seem to be dead ends and use those as starting points for subsequent tasks. Confronted by people who approach failure with a gloom and doom attitude, thinking that nothing is recoverable from such outcomes draw pictures（reframe Use visual aids, spontaneous sketches, whiteboards, diagrams, or other visualizations to organize thoughts. Encourage participants to draw or embellish others’ drawings. Participants are having trouble making sense of each other’s statements Frame the conversation（Involve, Redirect） Establish a structure for conversations, with clearly articulated topics and goals. To the extent feasible, identify items outside the scope of the discussion to avoid getting off track. Participants struggle to keep conversations focused or the agenda becomes dominated by a few players that distract from objectives. Go back to basics(redirect, involve) Rely on tried-and-true project management tools and techniques to keep project teams aligned and on track. Project teams begin to spin out of control because they take project management basics for granted Help me help you (empathize) “I know how important this design project is to your work here. I’d like to make sure you can be successful and meet the milestones of the larger project. What I can I do to help you meet those goals?” Position the team’s work and the team’s role relative to another’s goals. 展示团队的目标是如何与个人目标相一致的。 A stakeholder or participant signals that they see themselves as competitive with or opposed to the rest of the team. Help me make this better（involve） 让expert去帮助improve the design 参与者不愿意或不能提供建设性的反馈。 Help me prioritize （redirect） Ask participants to prioritize issues, requirements, feedback, or whatever else may be driving subsequent activities.（找重点） Presented with a list of issues that will impact the team’s ability to execute their plan or to complete tasks within the project’s constraints.（有好多问题要解决） Hold a workshop（involve） 组织一个meeting，可以让利益相关者来Structure a meeting as a collection of participatory activities combined with presentations, as if team members were attending a training workshop. By making the activity more participatory, teams can engage all stakeholders. Working with a team of people who need structure to actively contribute to a project. List assumptions（reframe） List the educated guesses the team made to allow them to move forward with the project. Assumptions may be related to any context: product, performance, plan, or purpose The list of assumptions may be used to justify decisions or as a tool to validate assumptions.团队里一些人没有什么看法，依赖于别人的看法。 make a plan （refame Identify a goal, a set of activities to reach that goal, and a set of milestones leading up to the goal. With multiple goals, be sure to prioritize. 面对大量的工作，没有明确的下一步如何取得进展 make assumptions （redirect） 不要让未知的信息阻碍了项目目标的实现。对丢失的信息进行有根据的猜测。一定要分享这些假设与项目团队提供设计决策的基本原理。 您已经准备好开始设计过程，但是无法弥补在理解上的差距 make it real （redirect） Take steps to embody abstract ideas 参与者在不考虑可行性的情况下抛出想法和反馈。 Offer alternatives（involve 提供两三个想法，让参与者对比和比较 提出了一个模糊的问题，将没有明确的标准来评估一个解决方案。 Offer a sneak peek(提供一个先睹为快)（invole 我们明天要讲三个概念，我先说一下你们明天会看到的。 Show or describe upcoming work in brief to set expectations about what will be seen or what participants will need to comment on. Presenting ideas or approaches that will challenge some underlying assumptions, as a way to build the right mindset in key participants. Pick one thing （redirect） Select one item from a list to focus on. 有很多issue困扰着 Pick your battles（empathize） 避免对抗，以后再说 Choose the right time to engage in active conflict. Facing a potentially major conflict that, compared to confrontations likely to emerge later, will have little impact on the final outcome. Prioritize the portfolio（优先考虑投资组合）redirect 虽然不喜欢这个project，但能提高职业目标 一个项目或任务的线程已经变得如此妥协，以至于很难在其中找到个人意义或满足感 Provide starting points（empathize） 给人们举一些例子来说明你所期望的工作水平 要给新人分配任务，团队，确立方向和期望值 Recount previous conversation（reframe 总结之前的对话，为当前的对话奠定基础 当和记忆里不好的人一起工作时，先确定她们agree之前的对话要点。（避免他们经常在会议中改变自己的想法） Reduce the assignment（redirect redirect 把手头任务的一小部分用来控制范围 有一个很大的项目，一小块的分配允许人们关注一个可控的设计问题和调整他们的预期。 Reflect the position（e） 重复别人说的话来确保自己听到的是正确的，也可以体现respect 当参与者觉得他们可能不理解对方的立场时 Seek small victories（redirect） Drive toward a win, no matter how small, to demonstrate success or establish a foundation of success. 努力争取胜利，无论多么小 Set reasonable expectations（redirect） Provide a clear account of how long tasks will take. 被问到项目的截止时间和范围，何时交付项目 Show the goal（Empathize, Involve, Redirect 让利益相关者尽可能生动地描述项目或任务的期望结果，确保他们知道他们要什么。Ask stakeholders to describe as vividly as possible the desired outcome of a project or task. This isn’t so much to describe the final design as it is to make sure they know what they’re getting. 项目已经花了很多时间，但还是不清楚stakeholders到底要什么 show your work（invole 揭示设计关键点，提供了基础和设计决策的理由 当给stakeholders看你的design idea时 take baby staps（redirect，involve introduce引进小小的改变 给项目，一种文化来影响大的charge 团队或组织的习惯根深蒂固,新的思维方式难以实现。 take responsibility（Empathize 诚实坦率地面对错误。主动帮忙收拾残局 Be honest and forthright with errors. Offer to help clean up the mess. Facing an error that has an impact on other team members or the success of the project. treat it like a project（reframe） 有一个问题很难达成一致， create a plan 去解决 建立目标、活动、依赖关系、角色和其他结构，以推动冲突的解决方案Establish a goal, activities, dependencies, roles, and other structure to drive toward a solution for a conflict Facing a conflict with so many moving parts that resolution requires careful planning. behavior how virtue interpretation ask questions that yield specific answers Clarity and Definition Structure questions to encourage increasingly direct and detailed responses. Yes/no questions are OK, so long as they validate a specific decision or direction. Centralize decision making 集中决策 At the beginning of the project, ask who owns final decisions about design. Lean on the decision maker to validate direction and approach Accountability and Ownership Clarify expectations regarding ability and delivery 在收到任务后，确保你明白任务的交付时间和任务 Accountability and Ownership 项目参与者应该让对方诚实地、公开地了解他们的工作地点 Communicate progress 日常保持小火苗！Establish a rhythm for communicating updates to project leads. Use a simple template for email or other electronic messages to communicate updates. Accountability and Ownership Don’t hog opportunities不要占用机会？？？ 在要说话之前，保持15分钟沉默，让别人先说 Awareness and Respect 让每个参与者都参与进来。 Embrace constructive criticism接受建设性的建议 先考虑一下这是他们的工作，也不算他们的错。在他们打击之前，先预测一下Anticipate critiques before they happen to soften the blow. Accountability and Ownership Embrace risk 明白风险，可能的消极后果 Accountability and Ownership Employ采用 tools that yield meaningful outcomes 判断工具是否能让项目继续Question the value of every activity or deliverable, and seek to understand how it will move the project forward and how it will lead to the next step Clarity and Definition make a contribution Encourage disruptive communications 采用多种沟通渠道，为团队成员提供各种相互交流的方式。 Clarity and Definition Engage in dialogue Show up to meetings with lots of questions prepared, whether you’re responsible for presenting concepts or not. Clarity and Definition 鼓励对话来阐述项目的概念、设计要求等。 Engage multiple senses to communicate 调用多种感官来交流 计划会议不只是说什么，而是要展示什么。有一个文档相机准备显示屏幕上快速草图或投射在墙上。注意图片所示的节奏,特别是,人们会花最多的时间看看照片 Clarity and Definition Use both speaking and pictures to engage team members. Establish role definitions If you’re not in charge of defining roles, ask for each participant’s responsibilities Clarity and Definition 确保团队中的每个人都知道他或她的职责是什么。Take the time to ensure they understand whether they own particular activities, or are just contributors. Give others room to learn from mistakes Offer to help colleagues reflect on their failures. Awareness and Respect Have a communications plan 使用模板为常见的电子邮件格式。建立一些规则用不同的交流方式。Identify who can respond to inquiries from different stakeholders Clarity and Definition 为团队成员之间的交流创建标准。 Have a project plan ensure you can answer who, what, where, when, why, and how questions about the project.确保你能回答谁，什么，什么，何时，为什么，以及如何对这个项目的问题 Clarity and Definition Create a project schedule with milestones and resource assignments. Clearly state how much time each team member should spend on each activity. Have decision-making mechanisms有决策机制 为设计或项目计划制定目标或原则以指导决策。指定具体的人负责,负责具体的决策。Establish goals or principles for the design or project plan to guide decisions. Designate specific people responsible and accountable for specific decisions. Clarity and Definition Have objectives for every discussion If you’re organizing the meeting, send an agenda, a list of topics, or even a one-sentence objective beforehand. If you’re not organizing the meeting, ask the organizer for the agenda or objectives. If it’s an ad hoc meeting, take a moment to validate expectations with other participants. Clarity and Definition know beforehand what you expect to come out of it. Keep meetings focused and short Conclude a meeting when it’s over, not when the clock says it’s over. Show up with an agenda and objectives so you know when it’s over. Awareness and Respect Golden Rule: Assume other people’s time is as valuable as yours. 假设别人的时间和你的一样宝贵 Know when you’re “spinning” 知道你遇到瓶颈的时候 在任务或任务上花一小段时间(大约10% - 20%的时间)，然后评估进度。如果开始适应,坚持下去。如果没有明确的方向，可以向同事寻求帮助。 Accountability and Ownership 意识到你的努力没有成效。旋转的行为将是一个问题解决,没有做出任何实质性的进展。有些人坚持啃一个问题,消耗时间和金钱,因为他们需要证明自己。 Offer direct critiques Avoid generalizations like “It’s not good.”避免笼统地说“这不好”。 Awareness and Respect Play to strengths 发挥优势 Reflect on abilities and skills to identify strengths反思能力和技能，以确定优势 Accountability and Ownership 确保项目中的角色和责任与团队成员的个人能力、技能和性格相一致。 Provide a rationale for decisions为决策提供依据 Enumerate key decisions and identify the primary rationale for driving them.列举关键决策并确定驱动它们的基本原理。 Accountability and Ownership 确保所有的决定——关于产品，关于计划，关于项目——都有合理的理由 Recognize contributions承认贡献 Accountability and Ownership if someone inspired a particular direction or lent an insight, give them a shout-out. Reduce competition In competitions, there is always a loser. Losers no longer feel as invested in the project. When people feel like they will make a meaningful contribution, regardless of their role, they will do better work and support each other in the pursuit of the project’s goals Accountability and Ownership 从设计过程中消除对彼此不利的设计过程。鼓励人们一起工作,而不是竞选。 Reflect on your performance Awareness and Respect 花点时间考虑一下你在一个项目或任务上的表现。识别领域你可以表现的更好,发挥你的长处。确定下次你会做不同的事情，然后吸取教训，下次再用。 Respect the calendar Awareness and Respect Set availability expectations Awareness and Respect Set performance expectations Awareness and Respect Clearly communicate ability to complete tasks and assignments. Traits Adaptability Adherence to style Assumption threshold 假设阈值 Creative triggers Defining the challenge Desired cadence 期望的节拍 Workload， client culture Dogmatism 教条主义 Format for feedback Giving and getting recognition Knee-jerk reaction 很快的反应 要么不思考马上赞同，要么马上反对 Level of abstraction 喜欢做抽象的事情 Perception of control Preferred environment Preferred perspective Project load Structure of design reviews Transparency 透明度","tags":[{"name":"BTH","slug":"BTH","permalink":"https://zjxjwxk.com/tags/BTH/"},{"name":"期末复习","slug":"期末复习","permalink":"https://zjxjwxk.com/tags/期末复习/"}]},{"title":"软件架构与质量考点","date":"2019-01-19T14:01:00.000Z","path":"2019/01/19/期末复习/软件架构与质量/软件架构与质量考点/","text":"CH 1. What is software architecture?What is software architectureThe software architecture of a system is the set of structures needed to reason about the system, which comprise software elements, relations among them, and properties of both. To find out what users of the system think about the system. × To assist in marketing activities. × To make estimate for projects planning purposes. √ To use as input for dividing up the work into tasks. √ To analyze and predict characteristics of the implemented system. √ To present the future development of the product. × Categories of structures First, some structures partition systems into implementation units called modules. Other structures are dynamic, meaning that they focus on the way the elements interact with each other at runtime to carry out the system’s functions. we will call runtime structures component-and-connector (C&amp;C) structures. A third kind of structure describes the mapping from software structures to the system’s organizational, developmental, installation, and execution environments. These mappings are called allocation structures. Three Kinds of Structures Module structures embody decisions as to how the system is to be structured as a set of code or data units that have to be constructed or procured. Decomposition structure. The units are modules that are related to each other by the is-a-submodule-of relation, showing how modules are decomposed into smaller modules recursively until the modules are small enough to be easily understood. Uses structure. The units are related by the uses relation, a specialized form of dependency. Layer structure. The modules in this structure are called layers. A layer is an abstract “virtual machine” that provides a cohesive set of services through a managed interface. Component-and-connector structures embody decisions as to how the system is to be structured as a set of elements that have runtime behavior (components) and interactions (connectors). Service structure. The units here are services that interoperate with each other by service coordination mechanisms. Concurrency structure. This component-and-connector structure allows the architect to determine opportunities for parallelism and the locations where resource contention may occur. Allocation structures embody decisions as to how the system will relate to nonsoftware structures in its environment (such as CPUs, file systems, networks, development teams, etc.). Deployment structure. The deployment structure shows how software is assigned to hardware processing and communication elements. Implementation structure. This structure shows how software elements (usually modules) are mapped to the file structure(s) in the system’s development, integration, or configuration control environments. Work assignment structure. This structure assigns responsibility for implementing and integrating the modules to the teams who will carry it out. CH 4. Understanding Quality AttributesSystem requirements can be categorized asFunctional requirements. These requirements state what the system must do, and how it must behave or react to run-time stimuli. Quality attribute requirements. These requirements annotate (qualify) functional requirements. Qualification might be how fast the function must be performed, how resilient it must be to erroneous input, how easy the function is to learn, etc. Constraints. A constraint is a design decision with zero degrees of freedom. That is, it’s a design decision that has already been made for you. Quality Attribute Requirements six parts Source of stimulus. This is some entity (a human, a computer system, or any other actuator) that generated the stimulus. Stimulus. The stimulus is a condition that requires a response when it arrives at a system. Environment. The stimulus occurs under certain conditions. The system may be in an overload condition or in normal operation, or some other relevant state. For many systems, “normal” operation can refer to one of a number of modes. For these kinds of systems, the environment should specify in which mode the system is executing. Artifact. Some artifact is stimulated. This may be a collection of systems, the whole system, or some piece or pieces of it. Response. The response is the activity undertaken as the result of the arrival of the stimulus. Response measure. When the response occurs, it should be measurable in some fashion so that the requirement can be tested. Guiding Quality Design Decisions Architecture design is a systematic approach to making design decisions. We categorize the design decisions that an architect needs to make as follows: Allocation of responsibilities Coordination model Data model Management of resources Mapping among architectural elements Binding time decisions Choice of technology Coordination model Software works by having elements interact with each other through designed mechanisms. These mechanisms are collectively referred to as a coordination model. Decisions about the coordination model include these: Identifying the elements of the system that must coordinate, or are prohibited from coordinating. Determining the properties of the coordination, such as timeliness, currency, completeness, correctness, and consistency. Choosing the communication mechanisms (between systems, between our system and external entities, between elements of our system) that realize those properties. Important properties of the communication mechanisms include stateful versus stateless, synchronous versus asynchronous, guaranteed versus nonguaranteed delivery, and performance-related properties such as throughput and latency. Example: Both asynchronous communication and synchronous communication can be used in the same system Asynchronous communication does not block the program thread until a response is ready Asynchronous communication guarantees when a response is returned Data model Every system must represent artifacts of system-wide interest—data—in some internal fashion. The collection of those representations and how to interpret them is referred to as the data model. Decisions about the data model include the following: Choosing the major data abstractions, their operations, and their properties. This includes determining how the data items are created, initialized, accessed, persisted, manipulated, translated, and destroyed. Compiling metadata needed for consistent interpretation of the data. Organizing the data. This includes determining whether the data is going to be kept in a relational database, a collection of objects, or both. If both, then the mapping between the two different locations of the data must be determined. Example: Choosing the major data abstractions, their operations, and their properties. Compiling metadata needed for consistent interpretation of the data. Organizing the data. Binding time decisions Binding time decisions introduce allowable ranges of variation. This variation can be bound at different times in the software life cycle by different entities— from design time by a developer to runtime by an end user. A binding time decision establishes the scope, the point in the life cycle, and the mechanism for achieving the variation.The decisions in the other six categories have an associated binding time decision. Examples of such binding time decisions include the following: For allocation of responsibilities, you can have build-time selection of modules via a parameterized makefile. For choice of coordination model, you can design runtime negotiation of protocols. For resource management, you can design a system to accept new peripheral devices plugged in at runtime, after which the system recognizes them and downloads and installs the right drivers automatically. For choice of technology, you can build an app store for a smartphone that automatically downloads the version of the app appropriate for the phone of the customer buying the app. Example: Setting the hostname of the server in a configuration file Using the user input to set the destination of a message Using inheritance in the code to execute the different subclass implementations depending on program state Quality attributes Availability Interoperability Modifiability Performance Security Testability Usability Development time qualities Modifiability Testability CH5. AvailabilityTerms Fault A failure’s cause is called a fault. A fault can be either internal or external to the system under consideration. Intermediate states between the occurrence of a fault and the occurrence of a failure are called errors. Failure A failure is the deviation of the system from its specification, where the deviation is externally visible. Fault and failure Fault Internal or external deviation of correct function Failure When the system cannot provide its intended service Caused by faults that could not be handled/repaired Resilient Faults can be prevented, tolerated, removed, or forecast. In this way a system becomes “resilient” to faults. Degraded operation mode we are often concerned with the level of capability that remains when a failure has occurred—a degraded operating mode. MTBF mean time between failures MTTR mean time to repair Formula$$MTBF\\over(MTBF+MTTR)$$ Service Level Agreement, SLA The availability provided by a computer system or hosting service is frequently expressed as a service-level agreement. This SLA specifies the availability level that is guaranteed and, usually, the penalties that the computer system or hosting service will suffer if the SLA is violated. Tactic Detect Faults Heart-beat Heartbeat is a fault detection mechanism that employs a periodic message exchange between a system monitor and a process being monitored. Ping/Echo Ping/echo refers to an asynchronous request/response message pair exchanged between nodes, used to determine reachability and the round-trip delay through the associated network path. Heart-beat tactic vs. Ping/Echo- tactic The big difference between heartbeat and ping/echo is who holds the responsibility for initiating the health check—the monitor or the component itself. Recover from Faults Active Redundancy Active redundancy (hot spare). This refers to a configuration where all of the nodes (active or redundant spare) in a protection group receive and process identical inputs in parallel, allowing the redundant spare(s) to maintain synchronous state with the active node(s). Passive Redundancy Passive redundancy (warm spare). This refers to a configuration where only the active members of the protection group process input traffic; one of their duties is to provide the redundant spare(s) with periodic state updates. Spare Spare (cold spare). Cold sparing refers to a configuration where the redundant spares of a protection group remain out of service until a fail-over occurs, at which point a power-on-reset procedure is initiated on the redundant spare prior to its being placed in service. Rollback Rollback. This tactic permits the system to revert to a previous known good state, referred to as the “rollback line”—rolling back time—upon the detection of a failure. Fault treeFault tree analysis is an analytical technique that specifies a state of the system that negatively impacts safety or reliability, and then analyzes the system’s context and operation to find all the ways that the undesired state could occur. A simple fault tree. D fails if A fails and either B or C fails. Fault tree gate symbols CH7. ModifiabilityWhat is Modifiability？ Modifiability is about change and our interest in it is in the cost and risk of making changes. To plan for modifiability, an architect has to consider four questions: What can change? A change can occur to any aspect of a system: the functions that the system computes, the platform (the hardware, operating system, middleware), the environment in which the system operates (the systems with which it must interoperate, the protocols it uses to communicate with the rest of the world), the qualities the system exhibits (its performance, its reliability, and even its future modifications), and its capacity (number of users supported, number of simultaneous operations). What is the likelihood of the change? One cannot plan a system for all potential changes—the system would never be done, or if it was done it would be far too expensive and would likely suffer quality attribute problems in other dimensions. Although anything might change, the architect has to make the tough decisions about which changes are likely, and hence which changes are to be supported, and which are not. When is the change made and who makes it? Most commonly in the past, a change was made to source code. Changes can be made to the implementation (by modifying the source code), during compile (using compile-time switches), during build (by choice of libraries), during configuration setup (by a range of techniques, including parameter setting), or during execution (by parameter settings, plugins, etc.). A change can also be made by a developer, an end user, or a system administrator. What is the cost of the change? Making a system more modifiable involves two types of cost: The cost of introducing the mechanism(s) to make the system more modifiable The cost of making the modification using the mechanism(s) CH8. PerformancePerformance General Scenario Portion of Scenario Possible Values Source Internal or external to the system Stimulus Arrival of a periodic, sporadic, or stochastic event Artifact System or one or more components in the system Environment Operational mode: normal, emergency, peak load, overload Response Process events, change level of service Response Measure Latency, deadline, throughput, jitter, miss rate Tactics for Performance Performance tactics Control Resource Demand Manage sampling rate. If it is possible to reduce the sampling frequency at which a stream of environmental data is captured, then demand can be reduced, typically with some attendant loss of fidelity. Limit event response. Process events only up to a set maximum rate, thereby ensuring more predictable processing when the events are actually processed. Prioritize events. If not all events are equally important, you can impose a priority scheme that ranks events according to how important it is to service them. Manage Resources Increase resources. Faster processors, additional processors, additional memory, and faster networks all have the potential for reducing latency. Introduce concurrency. Concurrency can be introduced by processing different streams of events on different threads or by creating additional threads to process different sets of activities. Maintain multiple copies of computations. Reduce the contention that would occur if all computations took place on a single server. CH13. Patterns and TacticsWhat is a Pattern?An architectural pattern is a package of design decisions that is found repeatedly in practice, has known properties that permit reuse, and describes a class of architectures. Architectural Pattern A context. A recuSrring, common situation in the world that gives rise to a problem. A problem. The problem, appropriately generalized, that arises in the given context. A solution. A successful architectural resolution to the problem, appropriately abstracted. The solution for a pattern is determined and described by: A set of element types (for example, data repositories, processes, and objects) A set of interaction mechanisms or connectors (for example, method calls, events, or message bus) A topological layout of the components A set of semantic constraints covering topology, element behavior, and interaction mechanisms CH18. Architecture DocumentView consistency A view is consistent with its definition when: All elements that fulfills the selection criterion is in the view All relations that fulfills the selection criterion is in the view That all properties that fulfills the selection criterion is in the view THAT NO additional elements, relation or properties that does not meet the selection is in the view Elements: All elements in the view must have a corresponding part in the view definition. Relation: Only relations that meet the selection criteria must be in the view. Properties: Properties must have values in the view. Criteria: Selection criteria can exclude certain elements or relations from the view. 4+1 view modelLogical, Process, Development, Physical + Use Cases","tags":[{"name":"BTH","slug":"BTH","permalink":"https://zjxjwxk.com/tags/BTH/"},{"name":"期末复习","slug":"期末复习","permalink":"https://zjxjwxk.com/tags/期末复习/"}]},{"title":"团队合作与职业规划试卷","date":"2019-01-19T14:01:00.000Z","path":"2019/01/19/期末复习/团队合作与职业规划/团队合作与职业规划试卷/","text":"1. During the lectures we defined three different areas important for every individual: Values, Interests and Skills. These should be described regarding your internal focus in a resume.a. Describe, explain, these three areas, including at least two examples from each area. (15) Values are what is important for you, what you really care about, and which give you a sense of purpose. Example: High Income, Helping others. Interests are what is fun for you, what enjoys you, and those work activities which hold your attention and fire your enthusiasm. Example: Technical, Scientific. Skills are things you can do well, things you have learned, special talent and special abilities. Example: Technical skills, Leadership. b. What is a GAP? Give at least one example of a possible GAP relating to your own experiences, one example from each area. (6) A GAP is where you are and where you want to be. The GAP for me: I hope that I can enter a big company like Alibaba to work as a Java developer. The GAP for me is that my understanding of the Java virtual machine is not deep enough, I don’t have enough knowledge of multithreading, don’t know enough about the principle and implementation of the database, and don’t know much about the distributed architecture. 2. Name the 5 elements of the Career Development Cycle. Draw the model of the cycle. Describe shortly, 1-2 sentences, every action in the cycle. (12) Communication, Analysis, Synthesis, Valuing, Execution Communication: Become aware of the gap and feel discomfort about the gap. Seek assistance if needed. Analysis: Clarify your knowledge, what do you want, what are your values, interests and skills and so on. Synthesis: Solve the gap, avoid missing alternatives and reduce to a manageable amount of options. Valuing: Judge the benefit (and cost) and rank them to find the best choice. Select an option. Execution: Convert decisions into action, formulate a goal and a plan, and execute the plan. Communication: Review the state and think has the gap been closed. It is an on-going process. 3. Brown talks about four general role categories of people in teams. Name these roles and describe them shortly? (12) Designers: People responsible for generating and documenting ideas about how the product works, looks, or behaves. Managers: People responsible for ensuring the project team delivers on its obligations, creates plans to do so, and successfully executes against those plans. Subject Matter Experts: People responsible for contributing information to the design process. Stakeholders: People ultimately accountable for the success of the project. 4. Consider the following questions among individuals where we have different characteristics. Select three of them. Describe how people (individuals), can have different characteristics. Describe pros and cons, and possible consequences to a characteristic. Comments if the characteristics you choose are good characteristics or not. a. Can I interrupt you? b. Do you attend agreed meetings? c. Are you late to meetings? d. Are you focusing on details or the big-picture? e. Which tasks do you prefer to commit to? f. How quickly do you respond to e-mail? g. Do you treat others how you would like to be treated yourself? h. Can she/he say no? Can you say no? i. Does she/he usually say no/yes? (12) a. Can I interrupt you? 5. Describe at least 4 positive consequences to conflicts. (8) Produces better ideas Forces people to search for new approaches Causes problems to surface Forces clarification 6. Brown draws a triangle for the model of conflict. Specify this triangle and describe the elements and how they are connected. (9) Situations: The different ways conflict manifests itself Patterns: The behaviors team members can use to deal with conflict Traits: The inherent characteristics that shape our behaviors and perceptions Situations &lt; &gt; Patterns Designers can use patterns (specific behaviors) to untangle situations Situations can also affect the outcome of patterns Patterns &lt; &gt; Traits A designer’s traits influences which pattern she chooses for a particular situation By using a particular pattern successfully, a designer may take that to reinforce part of her personality Traits &lt; &gt; Situations Traits can make certain situations worse by reinforcing the misunderstanding between people Some situations may amplify a designer’s trait 7. Brown lists three areas important for self-awareness. Describe these areas and give one example from each area for improving it. (9)To understand your limitations, your boundaries, strengths Limitations: Boundaries: By understanding their limitations, designers can be honest and open about their capabilities, their ability to contribute to a project, and their level of comfort in asking for help. Strengths:","tags":[{"name":"BTH","slug":"BTH","permalink":"https://zjxjwxk.com/tags/BTH/"},{"name":"期末复习","slug":"期末复习","permalink":"https://zjxjwxk.com/tags/期末复习/"}]},{"title":"算法分析与设计试卷","date":"2019-01-19T14:01:00.000Z","path":"2019/01/19/期末复习/算法分析与设计/算法分析与设计试卷/","text":"2. This question tests your knowledge on algorithms and algorithm construction:(a) A function that is defined in terms of itself is called a recursive function. Describe the purpose of a base case in a recursive function.(3p) A base case is an (input) value for which the function can be calculated without recursion. There needs to be at least one base case, which can be solved without recursion. For the cases that are solved using recursion, the recursive calls must progress towards a base case. (b) Mergesort is based on the principles of divide-and-conquer. Briefly describe what the mergesort algorithm does in the divide step and in the conquer step. (4p) Divide step: Divide the array into two parts to convert the problem of sorting the entire array into sub-problems (to sort the left and right arrays separately) until the size of the array is 1. Conquer step: Repeatedly merging sorted lists into sorted lists of larger size until the initial list is sorted. (c) A constructive heuristic is a method that iteratively “builds up” a solution. It starts with nothing and adds (fixes) the value of exactly one variable (solution component) in each of the iterations. The algorithm ends when all variables have been assigned a value. Describe what is a greedy constructive heuristic. (3p) Each variable fixing is chosen as the variable that (locally) improves the objective most. Of course, variable fixings are chosen without breaking feasibility. 3. This question test your knowledge on graphs and trees.(a) What does a “worst case” binary tree look like? (5p) In the worst case, if the binary search tree has n nodes, it can have O(n) height, when the unbalanced tree looks like a linked list. The worst case occurs when inserting an sorted list into the tree in order. (b) Describe what is a topological ordering. (4p) A topological ordering of a directed non-cyclic graph is an ordering of the vertices such that if there is an edge (u, v) between u and v, then u comes before v in the ordering. (c) Illustrate and explain using an example why there can be no topological ordering of a graph that contains a cycle. (6p) Consider the cycle v5 -&gt; v6 -&gt; v8 -&gt; v5: (v5, v6) 属于 E =&gt; v5 needs to come before v6 in the topological order. (v6, v8) 属于 E =&gt; v6 needs to come before v8 in the topological order =&gt; v5 before v8 in the topological order. (v8, v5) 属于 E =&gt; v8 needs to come before v5 in the topological order, which is not possible as we previously concluded the opposite. 4. This question concerns complexity analysis.(a) Briefly describe the complexity class P. (3p) All problems that can be solved using a polynomial bound algorithm belongs to the same complexity class (complexity class P). (b) Describe what is a basic operation of an algorithm. (3p) A basic operation can be seen as an operation that is fundamental for the performance of a particular algorithm. The performance of the algorithm is in principle proportional to the number of basic operations. (c) Describe the concepts of worst-case and average-case complexity of an algorithm. (6p) The worst-case complexity W(n) of an algorithm is the maximum number of basic operations performed for any input of size n. The average-case complexity A(n) of an algorithm is the average number of basic operations performed by the algorithm, where each input I occurs with some probability p(I). (d) What does it mean to say that a data structure has an amortized bound of O(n) per operation? (3p). This means that regardless of which sequence of n operations, the worst-case average cost per operation is O(n). 5. Your task for this question is to insert a node with value 5 into the following splay tree. You are required to show what the tree looks like after inserting the new node and after each of the (3) splay operations. Hint: you will have to perform all three types of splay operations. (20p) 6. Your task is to apply dynamic programming in order to solve a knapsackproblem instance with 4 items:Item 1: Value: p1 = 8 - Weight: w1 = 2Item 2: Value: p2 = 6 - Weight: w2 = 1Item 3: Value: p3 = 7 - Weight: w3 = 2Item 4: Value: p4 = 5 - Weight: w4 = 1The knapsack (bag) has a weight capacity of 4 (W = 4).You should graphically illustrate your solution. (20p)","tags":[{"name":"BTH","slug":"BTH","permalink":"https://zjxjwxk.com/tags/BTH/"},{"name":"期末复习","slug":"期末复习","permalink":"https://zjxjwxk.com/tags/期末复习/"}]},{"title":"CentOS 7 Tomcat开机自启动配置","date":"2019-01-12T16:04:00.000Z","path":"2019/01/13/Linux/CentOS 7/CentOS 7 Tomcat的安装及开机自启动配置/","text":"CentOS 7 Tomcat开机自启动配置配置开机运行Tomcat增加启动参数Tomcat需要增加一个pid文件，在 $CATALINA_HOME/bin 目录下面，增加 setenv.sh 配置，catalina.sh启动的时候会调用，同时配置Java内存参数。添加如下命令：[root@vps bin]# vim setenv.sh 12345678910111213#Tomcat startup pid#set Java runtime environment variable export JAVA_HOME=/usr/java/jdk1.8.0_191-amd64export PATH=$PATH:$JAVA_HOME/binexport CATALINA_HOME=/developer/apache-tomcat-7.0.91export CATALINA_BASE=/developer/apache-tomcat-7.0.91#add Tomcat pidCATALINA_PID=\"$CATALINA_BASE/tomcat.pid\"#add Java optsJAVA_OPTS=\"-server -XX:PermSize=256M -XX:MaxPermSize=1024m -Xms512M -Xmx1024M -XX:MaxNewSize=256m\" 注意: 配置开机运行时,需要再次添加 JAVA_HOME 增加 tomcat.service在/usr/lib/systemd/system目录下增加tomcat.service，目录必须是绝对目录，添加如下命令：[root@vps bin]# vim /usr/lib/systemd/system/tomcat.service 1234567891011121314151617# conf service desc ,set do this after network started[Unit]Description=tomcat After=syslog.target network.target remote-fs.target nss-lookup.target# conf service pid, start,stop and restart[Service]Type=forkingPIDFile=/developer/apache-tomcat-7.0.91/tomcat.pidExecStart=/developer/apache-tomcat-7.0.91/bin/startup.shExecStop=/bin/kill -s QUIT $MAINPIDExecReload=/bin/kill -s HUP $MAINPIDPrivateTmp=true# conf user [Install]WantedBy=multi-user.target [unit]: 配置了服务的描述，规定了在network启动之后执行， [service]: 配置服务的pid，服务的启动，停止，重启 [install]: 配置了使用用户 使用tomcat.servicecentos7使用systemctl替换了service命令，如需设置其他服务，替换此处的tomcat即可，如:systemctl start vsftp.service 启动服务systemctl start tomcat.service 停止服务systemctl stop tomcat.service 重启服务systemctl restart tomcat.service 增加开机启动systemctl enable tomcat.service 删除开机启动systemctl disable tomcat.service 因为配置pid，在启动的时候会在Tomcat的根目录下生产tomcat.pid文件,服务停止后删除。同时Tomcat在启动时，执行start不会启动两个Tomcat，保证始终只有一个Tomcat服务在运行。多个Tomcat可以配置在多个目录下，互不影响。 查看效果重启服务器后,通过wget访问，终端输出如下所示，配置tomcat开机自启动成功！ 12345678910[root@vps ~]# wget 35.234.8.23:8080--2019-01-12 16:02:41-- http://35.234.8.23:8080/Connecting to 35.234.8.23:8080... connected.HTTP request sent, awaiting response... 200 OKLength: 909 [text/html]Saving to: ‘index.html’100%[===========================================================&gt;] 909 --.-K/s in 0s 2019-01-12 16:02:41 (157 MB/s) - ‘index.html’ saved [909/909] 同时,客户端浏览器也能成功访问。","tags":[{"name":"Linux","slug":"Linux","permalink":"https://zjxjwxk.com/tags/Linux/"},{"name":"CentOS 7","slug":"CentOS-7","permalink":"https://zjxjwxk.com/tags/CentOS-7/"},{"name":"Tomcat","slug":"Tomcat","permalink":"https://zjxjwxk.com/tags/Tomcat/"}]},{"title":"J2EE基础知识","date":"2019-01-04T04:54:00.000Z","path":"2019/01/04/Java/J2EE/J2EE基础知识/","text":"Servlet总结在Java Web程序中，Servlet主要负责接收用户请求HttpServletRequest,在doGet(),doPost()中做相应的处理，并将回应HttpServletResponse反馈给用户。Servlet可以设置初始化参数，供Servlet内部使用。一个Servlet类只会有一个实例，在它初始化时调用init()方法，销毁时调用destroy()方法。Servlet需要在web.xml中配置（MyEclipse中创建Servlet会自动配置），一个Servlet可以设置多个URL访问。Servlet不是线程安全，因此要谨慎使用类变量。 阐述Servlet和CGI的区别?CGI的不足之处:1，需要为每个请求启动一个操作CGI程序的系统进程。如果请求频繁，这将会带来很大的开销。 2，需要为每个请求加载和运行一个CGI程序，这将带来很大的开销 3，需要重复编写处理网络协议的代码以及编码，这些工作都是非常耗时的。 Servlet的优点:1，只需要启动一个操作系统进程以及加载一个JVM，大大降低了系统的开销 2，如果多个请求需要做同样处理的时候，这时候只需要加载一个类，这也大大降低了开销 3，所有动态加载的类可以实现对网络协议以及请求解码的共享，大大降低了工作量。 4，Servlet能直接和Web服务器交互，而普通的CGI程序不能。Servlet还能在各个程序之间共享数据，使数据库连接池之类的功能很容易实现。 补充：Sun Microsystems公司在1996年发布Servlet技术就是为了和CGI进行竞争，Servlet是一个特殊的Java程序，一个基于Java的Web应用通常包含一个或多个Servlet类。Servlet不能够自行创建并执行，它是在Servlet容器中运行的，容器将用户的请求传递给Servlet程序，并将Servlet的响应回传给用户。通常一个Servlet会关联一个或多个JSP页面。以前CGI经常因为性能开销上的问题被诟病，然而Fast CGI早就已经解决了CGI效率上的问题，所以面试的时候大可不必信口开河的诟病CGI，事实上有很多你熟悉的网站都使用了CGI技术。 参考：《javaweb整合开发王者归来》P7 Servlet接口中有哪些方法及Servlet生命周期探秘Servlet接口定义了5个方法，其中前三个方法与Servlet生命周期相关： void init(ServletConfig config) throws ServletException void service(ServletRequest req, ServletResponse resp) throws ServletException, java.io.IOException void destory() java.lang.String getServletInfo() ServletConfig getServletConfig() 生命周期： Web容器加载Servlet并将其实例化后，Servlet生命周期开始，容器运行其init()方法进行Servlet的初始化；请求到达时调用Servlet的service()方法，service()方法会根据需要调用与请求对应的doGet或doPost等方法；当服务器关闭或项目被卸载时服务器会将Servlet实例销毁，此时会调用Servlet的destroy()方法。init方法和destory方法只会执行一次，service方法客户端每次请求Servlet都会执行。Servlet中有时会用到一些需要初始化与销毁的资源，因此可以把初始化资源的代码放入init方法中，销毁资源的代码放入destroy方法中，这样就不需要每次处理客户端的请求都要初始化与销毁资源。 参考：《javaweb整合开发王者归来》P81 get和post请求的区别 网上也有文章说：get和post请求实际上是没有区别，大家可以自行查询相关文章！我下面给出的只是一种常见的答案。 ①get请求用来从服务器上获得资源，而post是用来向服务器提交数据； ②get将表单中数据按照name=value的形式，添加到action 所指向的URL 后面，并且两者使用”?”连接，而各个变量之间使用”&amp;”连接；post是将表单中的数据放在HTTP协议的请求头或消息体中，传递到action所指向URL； ③get传输的数据要受到URL长度限制（1024字节即256个字符）；而post可以传输大量的数据，上传文件通常要使用post方式； ④使用get时参数会显示在地址栏上，如果这些数据不是敏感数据，那么可以使用get；对于敏感数据还是应用使用post； ⑤get使用MIME类型application/x-www-form-urlencoded的URL编码（也叫百分号编码）文本的格式传递参数，保证被传送的参数由遵循规范的文本组成，例如一个空格的编码是”%20”。 补充：GET方式提交表单的典型应用是搜索引擎。GET方式就是被设计为查询用的。 还有另外一种回答。推荐大家看一下： https://www.zhihu.com/question/28586791 https://mp.weixin.qq.com/s?__biz=MzI3NzIzMzg3Mw==&amp;mid=100000054&amp;idx=1&amp;sn=71f6c214f3833d9ca20b9f7dcd9d33e4#rd 什么情况下调用doGet()和doPost()Form标签里的method的属性为get时调用doGet()，为post时调用doPost()。 转发(Forward)和重定向(Redirect)的区别转发是服务器行为，重定向是客户端行为。 转发（Forword） 通过RequestDispatcher对象的forward（HttpServletRequest request,HttpServletResponse response）方法实现的。RequestDispatcher可以通过HttpServletRequest 的getRequestDispatcher()方法获得。例如下面的代码就是跳转到login_success.jsp页面。 1request.getRequestDispatcher(&quot;login_success.jsp&quot;).forward(request, response); 重定向（Redirect） 是利用服务器返回的状态吗来实现的。客户端浏览器请求服务器的时候，服务器会返回一个状态码。服务器通过HttpServletRequestResponse的setStatus(int status)方法设置状态码。如果服务器返回301或者302，则浏览器会到新的网址重新请求该资源。 从地址栏显示来说 forward是服务器请求资源,服务器直接访问目标地址的URL,把那个URL的响应内容读取过来,然后把这些内容再发给浏览器.浏览器根本不知道服务器发送的内容从哪里来的,所以它的地址栏还是原来的地址. redirect是服务端根据逻辑,发送一个状态码,告诉浏览器重新去请求那个地址.所以地址栏显示的是新的URL. 从数据共享来说 forward:转发页面和转发到的页面可以共享request里面的数据. redirect:不能共享数据. 从运用地方来说 forward:一般用于用户登陆的时候,根据角色转发到相应的模块. redirect:一般用于用户注销登陆时返回主页面和跳转到其它的网站等 从效率来说 forward:高. redirect:低. 自动刷新(Refresh)自动刷新不仅可以实现一段时间之后自动跳转到另一个页面，还可以实现一段时间之后自动刷新本页面。Servlet中通过HttpServletResponse对象设置Header属性实现自动刷新例如： 1Response.setHeader(&quot;Refresh&quot;,&quot;5;URL=http://localhost:8080/servlet/example.htm&quot;); 其中5为时间，单位为秒。URL指定就是要跳转的页面（如果设置自己的路径，就会实现每过一秒自动刷新本页面一次） Servlet与线程安全Servlet不是线程安全的，多线程并发的读写会导致数据不同步的问题。 解决的办法是尽量不要定义name属性，而是要把name变量分别定义在doGet()和doPost()方法内。虽然使用synchronized(name){}语句块可以解决问题，但是会造成线程的等待，不是很科学的办法。 注意：多线程的并发的读写Servlet类属性会导致数据不同步。但是如果只是并发地读取属性而不写入，则不存在数据不同步的问题。因此Servlet里的只读属性最好定义为final类型的。 参考：《javaweb整合开发王者归来》P92 JSP和Servlet是什么关系其实这个问题在上面已经阐述过了，Servlet是一个特殊的Java程序，它运行于服务器的JVM中，能够依靠服务器的支持向浏览器提供显示内容。JSP本质上是Servlet的一种简易形式，JSP会被服务器处理成一个类似于Servlet的Java程序，可以简化页面内容的生成。Servlet和JSP最主要的不同点在于，Servlet的应用逻辑是在Java文件中，并且完全从表示层中的HTML分离开来。而JSP的情况是Java和HTML可以组合成一个扩展名为.jsp的文件。有人说，Servlet就是在Java中写HTML，而JSP就是在HTML中写Java代码，当然这个说法是很片面且不够准确的。JSP侧重于视图，Servlet更侧重于控制逻辑，在MVC架构模式中，JSP适合充当视图（view）而Servlet适合充当控制器（controller）。 JSP工作原理JSP是一种Servlet，但是与HttpServlet的工作方式不太一样。HttpServlet是先由源代码编译为class文件后部署到服务器下，为先编译后部署。而JSP则是先部署后编译。JSP会在客户端第一次请求JSP文件时被编译为HttpJspPage类（接口Servlet的一个子类）。该类会被服务器临时存放在服务器工作目录里面。下面通过实例给大家介绍。 工程JspLoginDemo下有一个名为login.jsp的Jsp文件，把工程第一次部署到服务器上后访问这个Jsp文件，我们发现这个目录下多了下图这两个东东。 .class文件便是JSP对应的Servlet。编译完毕后再运行class文件来响应客户端请求。以后客户端访问login.jsp的时候，Tomcat将不再重新编译JSP文件，而是直接调用class文件来响应客户端请求。 JSP工作原理 由于JSP只会在客户端第一次请求的时候被编译 ，因此第一次请求JSP时会感觉比较慢，之后就会感觉快很多。如果把服务器保存的class文件删除，服务器也会重新编译JSP。 开发Web程序时经常需要修改JSP。Tomcat能够自动检测到JSP程序的改动。如果检测到JSP源代码发生了改动。Tomcat会在下次客户端请求JSP时重新编译JSP，而不需要重启Tomcat。这种自动检测功能是默认开启的，检测改动会消耗少量的时间，在部署Web应用的时候可以在web.xml中将它关掉。 参考：《javaweb整合开发王者归来》P97 JSP有哪些内置对象、作用分别是什么JSP内置对象 - CSDN博客 JSP有9个内置对象： request：封装客户端的请求，其中包含来自GET或POST请求的参数； response：封装服务器对客户端的响应； pageContext：通过该对象可以获取其他对象； session：封装用户会话的对象； application：封装服务器运行环境的对象； out：输出服务器响应的输出流对象； config：Web应用的配置对象； page：JSP页面本身（相当于Java程序中的this）； exception：封装页面抛出异常的对象。 Request对象的主要方法有哪些 setAttribute(String name,Object)：设置名字为name的request 的参数值 getAttribute(String name)：返回由name指定的属性值 getAttributeNames()：返回request 对象所有属性的名字集合，结果是一个枚举的实例 getCookies()：返回客户端的所有 Cookie 对象，结果是一个Cookie 数组 getCharacterEncoding() ：返回请求中的字符编码方式 = getContentLength() ：返回请求的 Body的长度 getHeader(String name) ：获得HTTP协议定义的文件头信息 getHeaders(String name) ：返回指定名字的request Header 的所有值，结果是一个枚举的实例 getHeaderNames() ：返回所以request Header 的名字，结果是一个枚举的实例 getInputStream() ：返回请求的输入流，用于获得请求中的数据 getMethod() ：获得客户端向服务器端传送数据的方法 getParameter(String name) ：获得客户端传送给服务器端的有 name指定的参数值 getParameterNames() ：获得客户端传送给服务器端的所有参数的名字，结果是一个枚举的实例 getParameterValues(String name)：获得有name指定的参数的所有值 getProtocol()：获取客户端向服务器端传送数据所依据的协议名称 getQueryString() ：获得查询字符串 getRequestURI() ：获取发出请求字符串的客户端地址 getRemoteAddr()：获取客户端的 IP 地址 getRemoteHost() ：获取客户端的名字 getSession([Boolean create]) ：返回和请求相关 Session getServerName() ：获取服务器的名字 getServletPath()：获取客户端所请求的脚本文件的路径 getServerPort()：获取服务器的端口号 removeAttribute(String name)：删除请求中的一个属性 request.getAttribute()和 request.getParameter()有何区别从获取方向来看： getParameter()是获取 POST/GET 传递的参数值； getAttribute()是获取对象容器中的数据值； 从用途来看： getParameter用于客户端重定向时，即点击了链接或提交按扭时传值用，即用于在用表单或url重定向传值时接收数据用。 getAttribute用于服务器端重定向时，即在 sevlet 中使用了 forward 函数,或 struts 中使用了 mapping.findForward。 getAttribute 只能收到程序用 setAttribute 传过来的值。 另外，可以用 setAttribute,getAttribute 发送接收对象.而 getParameter 显然只能传字符串。 setAttribute 是应用服务器把这个对象放在该页面所对应的一块内存中去，当你的页面服务器重定向到另一个页面时，应用服务器会把这块内存拷贝另一个页面所对应的内存中。这样getAttribute就能取得你所设下的值，当然这种方法可以传对象。session也一样，只是对象在内存中的生命周期不一样而已。getParameter只是应用服务器在分析你送上来的 request页面的文本时，取得你设在表单或 url 重定向时的值。 总结： getParameter 返回的是String,用于读取提交的表单中的值;（获取之后会根据实际需要转换为自己需要的相应类型，比如整型，日期类型啊等等） getAttribute 返回的是Object，需进行转换,可用setAttribute 设置成任意对象，使用很灵活，可随时用 include指令include的行为的区别include指令： JSP可以通过include指令来包含其他文件。被包含的文件可以是JSP文件、HTML文件或文本文件。包含的文件就好像是该JSP文件的一部分，会被同时编译执行。 语法格式如下： &lt;%@ include file=”文件相对 url 地址” %&gt; include动作： jsp:include动作元素用来包含静态和动态的文件。该动作把指定文件插入正在生成的页面。语法格式如下： &lt;jsp:include page=”相对 URL 地址” flush=”true” /&gt; JSP九大内置对象，七大动作，三大指令JSP九大内置对象，七大动作，三大指令总结 讲解JSP中的四种作用域JSP中的四种作用域包括page、request、session和application，具体来说： page代表与一个页面相关的对象和属性。 request代表与Web客户机发出的一个请求相关的对象和属性。一个请求可能跨越多个页面，涉及多个Web组件；需要在页面显示的临时数据可以置于此作用域。 session代表与某个用户与服务器建立的一次会话相关的对象和属性。跟某个用户相关的数据应该放在用户自己的session中。 application代表与整个Web应用程序相关的对象和属性，它实质上是跨越整个Web应用程序，包括多个页面、请求和会话的一个全局作用域。 如何实现JSP或Servlet的单线程模式对于JSP页面，可以通过page指令进行设置。 &lt;%@page isThreadSafe=”false”%&gt; 对于Servlet，可以让自定义的Servlet实现SingleThreadModel标识接口。 说明：如果将JSP或Servlet设置成单线程工作模式，会导致每个请求创建一个Servlet实例，这种实践将导致严重的性能问题（服务器的内存压力很大，还会导致频繁的垃圾回收），所以通常情况下并不会这么做。 实现会话跟踪的技术有哪些 使用Cookie 向客户端发送Cookie 123Cookie c =new Cookie(&quot;name&quot;,&quot;value&quot;); //创建Cookie c.setMaxAge(60*60*24); //设置最大时效，此处设置的最大时效为一天response.addCookie(c); //把Cookie放入到HTTP响应中 从客户端读取Cookie 123456789101112String name =&quot;name&quot;; Cookie[]cookies =request.getCookies(); if(cookies !=null)&#123; for(int i= 0;i&lt;cookies.length;i++)&#123; Cookie cookie =cookies[i]; if(name.equals(cookis.getName())) //something is here. //you can get the value cookie.getValue(); &#125; &#125; 优点: 数据可以持久保存，不需要服务器资源，简单，基于文本的Key-Value 缺点: 大小受到限制，用户可以禁用Cookie功能，由于保存在本地，有一定的安全风险。 URL 重写 在URL中添加用户会话的信息作为请求的参数，或者将唯一的会话ID添加到URL结尾以标识一个会话。 优点： 在Cookie被禁用的时候依然可以使用 缺点： 必须对网站的URL进行编码，所有页面必须动态生成，不能用预先记录下来的URL进行访问。 3.隐藏的表单域 1&lt;input type=&quot;hidden&quot; name =&quot;session&quot; value=&quot;...&quot;/&gt; 优点： Cookie被禁时可以使用 缺点： 所有页面必须是表单提交之后的结果。 HttpSession 在所有会话跟踪技术中，HttpSession对象是最强大也是功能最多的。当一个用户第一次访问某个网站时会自动创建 HttpSession，每个用户可以访问他自己的HttpSession。可以通过HttpServletRequest对象的getSession方 法获得HttpSession，通过HttpSession的setAttribute方法可以将一个值放在HttpSession中，通过调用 HttpSession对象的getAttribute方法，同时传入属性名就可以获取保存在HttpSession中的对象。与上面三种方式不同的 是，HttpSession放在服务器的内存中，因此不要将过大的对象放在里面，即使目前的Servlet容器可以在内存将满时将HttpSession 中的对象移到其他存储设备中，但是这样势必影响性能。添加到HttpSession中的值可以是任意Java对象，这个对象最好实现了 Serializable接口，这样Servlet容器在必要的时候可以将其序列化到文件中，否则在序列化时就会出现异常。 Cookie和Session的的区别 由于HTTP协议是无状态的协议，所以服务端需要记录用户的状态时，就需要用某种机制来识具体的用户，这个机制就是Session.典型的场景比如购物车，当你点击下单按钮时，由于HTTP协议无状态，所以并不知道是哪个用户操作的，所以服务端要为特定的用户创建了特定的Session，用用于标识这个用户，并且跟踪用户，这样才知道购物车里面有几本书。这个Session是保存在服务端的，有一个唯一标识。在服务端保存Session的方法很多，内存、数据库、文件都有。集群的时候也要考虑Session的转移，在大型的网站，一般会有专门的Session服务器集群，用来保存用户会话，这个时候 Session 信息都是放在内存的，使用一些缓存服务比如Memcached之类的来放 Session。 思考一下服务端如何识别特定的客户？这个时候Cookie就登场了。每次HTTP请求的时候，客户端都会发送相应的Cookie信息到服务端。实际上大多数的应用都是用 Cookie 来实现Session跟踪的，第一次创建Session的时候，服务端会在HTTP协议中告诉客户端，需要在 Cookie 里面记录一个Session ID，以后每次请求把这个会话ID发送到服务器，我就知道你是谁了。有人问，如果客户端的浏览器禁用了 Cookie 怎么办？一般这种情况下，会使用一种叫做URL重写的技术来进行会话跟踪，即每次HTTP交互，URL后面都会被附加上一个诸如 sid=xxxxx 这样的参数，服务端据此来识别用户。 Cookie其实还可以用在一些方便用户的场景下，设想你某次登陆过一个网站，下次登录的时候不想再次输入账号了，怎么办？这个信息可以写到Cookie里面，访问网站的时候，网站页面的脚本可以读取这个信息，就自动帮你把用户名给填了，能够方便一下用户。这也是Cookie名称的由来，给用户的一点甜头。所以，总结一下：Session是在服务端保存的一个数据结构，用来跟踪用户的状态，这个数据可以保存在集群、数据库、文件中；Cookie是客户端保存用户信息的一种机制，用来记录用户的一些信息，也是实现Session的一种方式。 参考： https://www.zhihu.com/question/19786827/answer/28752144 《javaweb整合开发王者归来》P158 Cookie和Session的比较","tags":[{"name":"Java","slug":"Java","permalink":"https://zjxjwxk.com/tags/Java/"},{"name":"J2EE","slug":"J2EE","permalink":"https://zjxjwxk.com/tags/J2EE/"}]},{"title":"Hello World","date":"2019-01-03T15:13:13.800Z","path":"2019/01/03/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"Java基础知识","date":"2019-01-03T14:44:22.000Z","path":"2019/01/03/Java/Java核心/Java基础知识/","text":"1. 面向对象和面向过程的区别面向过程优点： 性能比面向对象高，因为类调用时需要实例化，开销比较大，比较消耗资源;比如单片机、嵌入式开发、Linux/Unix等一般采用面向过程开发，性能是最重要的因素。 缺点： 没有面向对象易维护、易复用、易扩展 面向对象优点： 易维护、易复用、易扩展，由于面向对象有封装、继承、多态性的特性，可以设计出低耦合的系统，使系统更加灵活、更加易于维护 缺点： 性能比面向过程低 2. Java 语言有哪些特点 简单易学； 面向对象（封装，继承，多态）； 平台无关性（ Java 虚拟机实现平台无关性）； 可靠性； 安全性； 支持多线程（ C++ 语言没有内置的多线程机制，因此必须调用操作系统的多线程功能来进行多线程程序设计，而 Java 语言却提供了多线程支持）； 支持网络编程并且很方便（ Java 语言诞生本身就是为简化网络编程设计的，因此 Java 语言不仅支持网络编程而且很方便）； 编译与解释并存； 3. 什么是 JDK 什么是 JRE 什么是 JVM 三者之间的联系与区别这几个是Java中很基本很基本的东西，但是我相信一定还有很多人搞不清楚！为什么呢？因为我们大多数时候在使用现成的编译工具以及环境的时候，并没有去考虑这些东西。 JDK: JDK（Java Development Kit）顾名思义它是给开发者提供的开发工具箱,是给程序开发者用的。它除了包括完整的JRE（Java Runtime Environment），Java运行环境，还包含了其他供开发者使用的工具包。 JRE: 普通用户而只需要安装 JRE（Java Runtime Environment）来运行 Java 程序。而程序开发者必须安装JDK来编译、调试程序。 JVM： 当我们运行一个程序时，JVM 负责将字节码转换为特定机器代码，JVM 提供了内存管理/垃圾回收和安全机制等。这种独立于硬件和操作系统，正是 java 程序可以一次编写多处执行的原因。 区别与联系： JDK 用于开发，JRE 用于运行java程序 ； JDK 和 JRE 中都包含 JVM ； JVM 是 java 编程语言的核心并且具有平台独立性。 4. 什么是字节码 采用字节码的最大好处是什么先看下 java 中的编译器和解释器： Java 中引入了虚拟机的概念，即在机器和编译程序之间加入了一层抽象的虚拟的机器。这台虚拟的机器在任何平台上都提供给编译程序一个的共同的接口。 编译程序只需要面向虚拟机，生成虚拟机能够理解的代码，然后由解释器来将虚拟机代码转换为特定系统的机器码执行。在 Java 中，这种供虚拟机理解的代码叫做字节码（即扩展名为 .class 的文件），它不面向任何特定的处理器，只面向虚拟机。 每一种平台的解释器是不同的，但是实现的虚拟机是相同的。Java 源程序经过编译器编译后变成字节码，字节码由虚拟机解释执行，虚拟机将每一条要执行的字节码送给解释器，解释器将其翻译成特定机器上的机器码，然后在特定的机器上运行。这也就是解释了 Java 的编译与解释并存的特点。 Java 源代码—-&gt;编译器—-&gt;jvm 可执行的 Java 字节码(即虚拟指令)—-&gt;jvm—-&gt;jvm 中解释器—–&gt;机器可执行的二进制机器码—-&gt;程序运行。 采用字节码的好处： Java 语言通过字节码的方式，在一定程度上解决了传统解释型语言执行效率低的问题，同时又保留了解释型语言可移植的特点。所以 Java 程序运行时比较高效，而且，由于字节码并不专对一种特定的机器，因此，Java程序无须重新编译便可在多种不同的计算机上运行。 解释型语言：解释型语言，是在运行的时候将程序翻译成机器语言。解释型语言的程序不需要在运行前编译，在运行程序的时候才翻译，专门的解释器负责在每个语句执行的时候解释程序代码。这样解释型语言每执行一次就要翻译一次，效率比较低。——百度百科 5. Java和C++的区别我知道很多人没学过 C++，但是面试官就是没事喜欢拿咱们 Java 和 C++ 比呀！没办法！！！就算没学过C++，也要记下来！ 都是面向对象的语言，都支持封装、继承和多态 Java 不提供指针来直接访问内存，程序内存更加安全 Java 的类是单继承的，C++ 支持多重继承；虽然 Java 的类不可以多继承，但是接口可以多继承。 Java 有自动内存管理机制，不需要程序员手动释放无用内存 6. 什么是 Java 程序的主类 应用程序和小程序的主类有何不同一个程序中可以有多个类，但只能有一个类是主类。在 Java 应用程序中，这个主类是指包含 main（）方法的类。而在 Java 小程序中，这个主类是一个继承自系统类 JApplet 或 Applet 的子类。应用程序的主类不一定要求是 public 类，但小程序的主类要求必须是 public 类。主类是 Java 程序执行的入口点。 7. Java 应用程序与小程序之间有那些差别简单说应用程序是从主线程启动(也就是 main() 方法)。applet 小程序没有main方法，主要是嵌在浏览器页面上运行(调用init()线程或者run()来启动)，嵌入浏览器这点跟 flash 的小游戏类似。 8. 字符型常量和字符串常量的区别 形式上: 字符常量是单引号引起的一个字符 字符串常量是双引号引起的若干个字符 含义上: 字符常量相当于一个整形值( ASCII 值),可以参加表达式运算 字符串常量代表一个地址值(该字符串在内存中存放位置) 占内存大小 字符常量只占2个字节 字符串常量占若干个字节(至少一个字符结束标志) (注意： char在Java中占两个字节) java编程思想第四版：2.2.2节 9. 构造器 Constructor 是否可被 override在讲继承的时候我们就知道父类的私有属性和构造方法并不能被继承，所以 Constructor 也就不能被 override（重写）,但是可以 overload（重载）,所以你可以看到一个类中有多个构造函数的情况。 10. 重载和重写的区别重载： 发生在同一个类中，方法名必须相同，参数类型不同、个数不同、顺序不同，方法返回值和访问修饰符可以不同，发生在编译时。 重写： 发生在父子类中，方法名、参数列表必须相同，返回值范围小于等于父类，抛出的异常范围小于等于父类，访问修饰符范围大于等于父类；如果父类方法访问修饰符为 private 则子类就不能重写该方法。 11. Java 面向对象编程三大特性:封装、继承、多态封装封装把一个对象的属性私有化，同时提供一些可以被外界访问的属性的方法，如果属性不想被外界访问，我们大可不必提供方法给外界访问。但是如果一个类没有提供给外界访问的方法，那么这个类也没有什么意义了。 继承继承是使用已存在的类的定义作为基础建立新类的技术，新类的定义可以增加新的数据或新的功能，也可以用父类的功能，但不能选择性地继承父类。通过使用继承我们能够非常方便地复用以前的代码。 关于继承如下 3 点请记住： 子类拥有父类非 private 的属性和方法。 子类可以拥有自己属性和方法，即子类可以对父类进行扩展。 子类可以用自己的方式实现父类的方法。（以后介绍）。 多态所谓多态就是指程序中定义的引用变量所指向的具体类型和通过该引用变量发出的方法调用在编程时并不确定，而是在程序运行期间才确定，即一个引用变量倒底会指向哪个类的实例对象，该引用变量发出的方法调用到底是哪个类中实现的方法，必须在由程序运行期间才能决定。 在Java中有两种形式可以实现多态：继承（多个子类对同一方法的重写）和接口（实现接口并覆盖接口中同一方法）。 12. String 和 StringBuffer、StringBuilder 的区别是什么 String 为什么是不可变的可变性 简单的来说：String 类中使用 final 关键字字符数组保存字符串，private final char value[]，所以 String 对象是不可变的。而StringBuilder 与 StringBuffer 都继承自 AbstractStringBuilder 类，在 AbstractStringBuilder 中也是使用字符数组保存字符串char[]value 但是没有用 final 关键字修饰，所以这两种对象都是可变的。 StringBuilder 与 StringBuffer 的构造方法都是调用父类构造方法也就是 AbstractStringBuilder 实现的，大家可以自行查阅源码。 AbstractStringBuilder.java 12345678abstract class AbstractStringBuilder implements Appendable, CharSequence &#123; char[] value; int count; AbstractStringBuilder() &#123; &#125; AbstractStringBuilder(int capacity) &#123; value = new char[capacity]; &#125; 线程安全性 String 中的对象是不可变的，也就可以理解为常量，线程安全。AbstractStringBuilder 是 StringBuilder 与 StringBuffer 的公共父类，定义了一些字符串的基本操作，如 expandCapacity、append、insert、indexOf 等公共方法。StringBuffer 对方法加了同步锁或者对调用的方法加了同步锁，所以是线程安全的。StringBuilder 并没有对方法进行加同步锁，所以是非线程安全的。 性能 每次对 String 类型进行改变的时候，都会生成一个新的 String 对象，然后将指针指向新的 String 对象。StringBuffer 每次都会对 StringBuffer 对象本身进行操作，而不是生成新的对象并改变对象引用。相同情况下使用 StirngBuilder 相比使用 StringBuffer 仅能获得 10%~15% 左右的性能提升，但却要冒多线程不安全的风险。 对于三者使用的总结： 操作少量的数据 = String 单线程操作字符串缓冲区下操作大量数据 = StringBuilder 多线程操作字符串缓冲区下操作大量数据 = StringBuffer 13. 自动装箱与拆箱装箱：将基本类型用它们对应的引用类型包装起来； 拆箱：将包装类型转换为基本数据类型； 14. 在一个静态方法内调用一个非静态成员为什么是非法的由于静态方法可以不通过对象进行调用，因此在静态方法里，不能调用其他非静态变量，也不可以访问非静态变量成员。 15. 在 Java 中定义一个不做事且没有参数的构造方法的作用 Java 程序在执行子类的构造方法之前，如果没有用 super() 来调用父类特定的构造方法，则会调用父类中“没有参数的构造方法”。因此，如果父类中只定义了有参数的构造方法，而在子类的构造方法中又没有用 super() 来调用父类中特定的构造方法，则编译时将发生错误，因为 Java 程序在父类中找不到没有参数的构造方法可供执行。解决办法是在父类里加上一个不做事且没有参数的构造方法。 16. import java和javax有什么区别刚开始的时候 JavaAPI 所必需的包是 java 开头的包，javax 当时只是扩展 API 包来说使用。然而随着时间的推移，javax 逐渐的扩展成为 Java API 的组成部分。但是，将扩展从 javax 包移动到 java 包将是太麻烦了，最终会破坏一堆现有的代码。因此，最终决定 javax 包将成为标准API的一部分。 所以，实际上java和javax没有区别。这都是一个名字。 17. 接口和抽象类的区别是什么 接口的方法默认是 public，所有方法在接口中不能有实现(Java 8 开始接口方法可以有默认实现），抽象类可以有非抽象的方法 接口中的实例变量默认是 final 类型的，而抽象类中则不一定 一个类可以实现多个接口，但最多只能实现一个抽象类 一个类实现接口的话要实现接口的所有方法，而抽象类不一定 接口不能用 new 实例化，但可以声明，但是必须引用一个实现该接口的对象 从设计层面来说，抽象是对类的抽象，是一种模板设计，接口是行为的抽象，是一种行为的规范。 18. 成员变量与局部变量的区别有那些 从语法形式上，看成员变量是属于类的，而局部变量是在方法中定义的变量或是方法的参数；成员变量可以被 public,private,static 等修饰符所修饰，而局部变量不能被访问控制修饰符及 static 所修饰；但是，成员变量和局部变量都能被 final 所修饰； 从变量在内存中的存储方式来看，成员变量是对象的一部分，而对象存在于堆内存，局部变量存在于栈内存 从变量在内存中的生存时间上看，成员变量是对象的一部分，它随着对象的创建而存在，而局部变量随着方法的调用而自动消失。 成员变量如果没有被赋初值，则会自动以类型的默认值而赋值（一种情况例外被 final 修饰的成员变量也必须显示地赋值）；而局部变量则不会自动赋值。 19. 创建一个对象用什么运算符？对象实体与对象引用有何不同？new运算符，new创建对象实例（对象实例在堆内存中），对象引用指向对象实例（对象引用存放在栈内存中）。一个对象引用可以指向0个或1个对象（一根绳子可以不系气球，也可以系一个气球）;一个对象可以有n个引用指向它（可以用n条绳子系住一个气球）。 20. 什么是方法的返回值？返回值在类的方法里的作用是什么？方法的返回值是指我们获取到的某个方法体中的代码执行后产生的结果！（前提是该方法可能产生结果）。返回值的作用:接收出结果，使得它可以用于其他的操作！ 21. 一个类的构造方法的作用是什么 若一个类没有声明构造方法，该程序能正确执行吗 为什么主要作用是完成对类对象的初始化工作。可以执行。因为一个类即使没有声明构造方法也会有默认的不带参数的构造方法。 22. 构造方法有哪些特性 名字与类名相同； 没有返回值，但不能用void声明构造函数； 生成类的对象时自动执行，无需调用。 23. 静态方法和实例方法有何不同 在外部调用静态方法时，可以使用”类名.方法名”的方式，也可以使用”对象名.方法名”的方式。而实例方法只有后面这种方式。也就是说，调用静态方法可以无需创建对象。 静态方法在访问本类的成员时，只允许访问静态成员（即静态成员变量和静态方法），而不允许访问实例成员变量和实例方法；实例方法则无此限制. 24. 对象的相等与指向他们的引用相等，两者有什么不同？对象的相等，比的是内存中存放的内容是否相等。而引用相等，比较的是他们指向的内存地址是否相等。 25. 在调用子类构造方法之前会先调用父类没有参数的构造方法，其目的是？帮助子类做初始化工作。 26. == 与 equals(重要)== : 它的作用是判断两个对象的地址是不是相等。即，判断两个对象是不是同一个对象。(基本数据类型==比较的是值，引用数据类型==比较的是内存地址) equals() : 它的作用也是判断两个对象是否相等。但它一般有两种使用情况： 情况1：类没有覆盖 equals() 方法。则通过 equals() 比较该类的两个对象时，等价于通过“==”比较这两个对象。 情况2：类覆盖了 equals() 方法。一般，我们都覆盖 equals() 方法来两个对象的内容相等；若它们的内容相等，则返回 true (即，认为这两个对象相等)。 举个例子： 1234567891011121314151617public class test1 &#123; public static void main(String[] args) &#123; String a = new String(&quot;ab&quot;); // a 为一个引用 String b = new String(&quot;ab&quot;); // b为另一个引用,对象的内容一样 String aa = &quot;ab&quot;; // 放在常量池中 String bb = &quot;ab&quot;; // 从常量池中查找 if (aa == bb) // true System.out.println(&quot;aa==bb&quot;); if (a == b) // false，非同一对象 System.out.println(&quot;a==b&quot;); if (a.equals(b)) // true System.out.println(&quot;aEQb&quot;); if (42 == 42.0) &#123; // true System.out.println(&quot;true&quot;); &#125; &#125;&#125; 说明： String 中的 equals 方法是被重写过的，因为 object 的 equals 方法是比较的对象的内存地址，而 String 的 equals 方法比较的是对象的值。 当创建 String 类型的对象时，虚拟机会在常量池中查找有没有已经存在的值和要创建的值相同的对象，如果有就把它赋给当前引用。如果没有就在常量池中重新创建一个 String 对象。 27. hashCode 与 equals（重要）面试官可能会问你：“你重写过 hashcode 和 equals 么，为什么重写equals时必须重写hashCode方法？” hashCode（）介绍hashCode() 的作用是获取哈希码，也称为散列码；它实际上是返回一个int整数。这个哈希码的作用是确定该对象在哈希表中的索引位置。hashCode() 定义在JDK的Object.java中，这就意味着Java中的任何类都包含有hashCode() 函数。 散列表存储的是键值对(key-value)，它的特点是：能根据“键”快速的检索出对应的“值”。这其中就利用到了散列码！（可以快速找到所需要的对象） 为什么要有 hashCode我们以“HashSet 如何检查重复”为例子来说明为什么要有 hashCode： 当你把对象加入 HashSet 时，HashSet 会先计算对象的 hashcode 值来判断对象加入的位置，同时也会与其他已经加入的对象的 hashcode 值作比较，如果没有相符的hashcode，HashSet会假设对象没有重复出现。但是如果发现有相同 hashcode 值的对象，这时会调用 equals（）方法来检查 hashcode 相等的对象是否真的相同。如果两者相同，HashSet 就不会让其加入操作成功。如果不同的话，就会重新散列到其他位置。（摘自我的Java启蒙书《Head fist java》第二版）。这样我们就大大减少了 equals 的次数，相应就大大提高了执行速度。 hashCode（）与equals（）的相关规定 如果两个对象相等，则hashcode一定也是相同的 两个对象相等,对两个对象分别调用equals方法都返回true 两个对象有相同的hashcode值，它们也不一定是相等的 因此，equals 方法被覆盖过，则 hashCode 方法也必须被覆盖 hashCode() 的默认行为是对堆上的对象产生独特值。如果没有重写 hashCode()，则该 class 的两个对象无论如何都不会相等（即使这两个对象指向相同的数据） 28. 为什么Java中只有值传递为什么Java中只有值传递？ 29. 简述线程，程序、进程的基本概念。以及他们之间关系是什么线程与进程相似，但线程是一个比进程更小的执行单位。一个进程在其执行的过程中可以产生多个线程。与进程不同的是同类的多个线程共享同一块内存空间和一组系统资源，所以系统在产生一个线程，或是在各个线程之间作切换工作时，负担要比进程小得多，也正因为如此，线程也被称为轻量级进程。 程序是含有指令和数据的文件，被存储在磁盘或其他的数据存储设备中，也就是说程序是静态的代码。 进程是程序的一次执行过程，是系统运行程序的基本单位，因此进程是动态的。系统运行一个程序即是一个进程从创建，运行到消亡的过程。简单来说，一个进程就是一个执行中的程序，它在计算机中一个指令接着一个指令地执行着，同时，每个进程还占有某些系统资源如CPU时间，内存空间，文件，文件，输入输出设备的使用权等等。换句话说，当程序在执行时，将会被操作系统载入内存中。 线程是进程划分成的更小的运行单位。线程和进程最大的不同在于基本上各进程是独立的，而各线程则不一定，因为同一进程中的线程极有可能会相互影响。从另一角度来说，进程属于操作系统的范畴，主要是同一段时间内，可以同时执行一个以上的程序，而线程则是在同一程序内几乎同时执行一个以上的程序段。 30. 线程有哪些基本状态？这些状态是如何定义的? 新建(new)：新创建了一个线程对象。 可运行(runnable)：线程对象创建后，其他线程(比如main线程）调用了该对象的start()方法。该状态的线程位于可运行线程池中，等待被线程调度选中，获 取cpu的使用权。 运行(running)：可运行状态(runnable)的线程获得了cpu时间片（timeslice），执行程序代码。 阻塞(block)：阻塞状态是指线程因为某种原因放弃了cpu使用权，也即让出了cpu timeslice，暂时停止运行。直到线程进入可运行(runnable)状态，才有 机会再次获得cpu timeslice转到运行(running)状态。阻塞的情况分三种： (一). 等待阻塞：运行(running)的线程执行o.wait()方法，JVM会把该线程放 入等待队列(waitting queue)中。 (二). 同步阻塞：运行(running)的线程在获取对象的同步锁时，若该同步锁 被别的线程占用，则JVM会把该线程放入锁池(lock pool)中。 (三). 其他阻塞: 运行(running)的线程执行Thread.sleep(long ms)或t.join()方法，或者发出了I/O请求时，JVM会把该线程置为阻塞状态。当sleep()状态超时join()等待线程终止或者超时、或者I/O处理完毕时，线程重新转入可运行(runnable)状态。 死亡(dead)：线程run()、main()方法执行结束，或者因异常退出了run()方法，则该线程结束生命周期。死亡的线程不可再次复生。 备注： 可以用早起坐地铁来比喻这个过程： 还没起床：sleeping 起床收拾好了，随时可以坐地铁出发：Runnable 等地铁来：Waiting 地铁来了，但要排队上地铁：I/O阻塞 上了地铁，发现暂时没座位：synchronized阻塞 地铁上找到座位：Running 到达目的地：Dead 31 关于 final 关键字的一些总结final关键字主要用在三个地方：变量、方法、类。 对于一个final变量，如果是基本数据类型的变量，则其数值一旦在初始化之后便不能更改；如果是引用类型的变量，则在对其初始化之后便不能再让其指向另一个对象。 当用final修饰一个类时，表明这个类不能被继承。final类中的所有成员方法都会被隐式地指定为final方法。 使用final方法的原因有两个。第一个原因是把方法锁定，以防任何继承类修改它的含义；第二个原因是效率。在早期的Java实现版本中，会将final方法转为内嵌调用。但是如果方法过于庞大，可能看不到内嵌调用带来的任何性能提升（现在的Java版本已经不需要使用final方法进行这些优化了）。类中所有的private方法都隐式地指定为final。 32 Java 中的异常处理Java异常类层次结构图 Java异常类层次结构图 在 Java 中，所有的异常都有一个共同的祖先java.lang包中的 Throwable类。Throwable： 有两个重要的子类：Exception（异常） 和 Error（错误） ，二者都是 Java 异常处理的重要子类，各自都包含大量子类。 Error（错误）:是程序无法处理的错误，表示运行应用程序中较严重问题。大多数错误与代码编写者执行的操作无关，而表示代码运行时 JVM（Java 虚拟机）出现的问题。例如，Java虚拟机运行错误（Virtual MachineError），当 JVM 不再有继续执行操作所需的内存资源时，将出现 OutOfMemoryError。这些异常发生时，Java虚拟机（JVM）一般会选择线程终止。 这些错误表示故障发生于虚拟机自身、或者发生在虚拟机试图执行应用时，如Java虚拟机运行错误（Virtual MachineError）、类定义错误（NoClassDefFoundError）等。这些错误是不可查的，因为它们在应用程序的控制和处理能力之 外，而且绝大多数是程序运行时不允许出现的状况。对于设计合理的应用程序来说，即使确实发生了错误，本质上也不应该试图去处理它所引起的异常状况。在 Java中，错误通过Error的子类描述。 Exception（异常）:是程序本身可以处理的异常。Exception 类有一个重要的子类 RuntimeException。RuntimeException 异常由Java虚拟机抛出。NullPointerException（要访问的变量没有引用任何对象时，抛出该异常）、ArithmeticException（算术运算异常，一个整数除以0时，抛出该异常）和 ArrayIndexOutOfBoundsException （下标越界异常）。 注意：异常和错误的区别：异常能被程序本身可以处理，错误是无法处理。 Throwable类常用方法 public string getMessage():返回异常发生时的详细信息 public string toString():返回异常发生时的简要描述 public string getLocalizedMessage():返回异常对象的本地化信息。使用Throwable的子类覆盖这个方法，可以声称本地化信息。如果子类没有覆盖该方法，则该方法返回的信息与getMessage（）返回的结果相同 public void printStackTrace():在控制台上打印Throwable对象封装的异常信息 异常处理总结 try 块：用于捕获异常。其后可接零个或多个catch块，如果没有catch块，则必须跟一个finally块。 catch 块：用于处理try捕获到的异常。 finally 块：无论是否捕获或处理异常，finally块里的语句都会被执行。当在try块或catch块中遇到return语句时，finally语句块将在方法返回之前被执行。 在以下4种特殊情况下，finally块不会被执行： 在finally语句块中发生了异常。 在前面的代码中用了System.exit()退出程序。 程序所在的线程死亡。 关闭CPU。 33 Java序列话中如果有些字段不想进行序列化 怎么办对于不想进行序列化的变量，使用transient关键字修饰。 transient关键字的作用是：阻止实例中那些用此关键字修饰的的变量序列化；当对象被反序列化时，被transient修饰的变量值不会被持久化和恢复。transient只能修饰变量，不能修饰类和方法。 34 获取用键盘输入常用的的两种方法方法1：通过 Scanner 123Scanner input = new Scanner(System.in);String s = input.nextLine();input.close(); 方法2：通过 BufferedReader 12BufferedReader input = new BufferedReader(new InputStreamReader(System.in)); String s = input.readLine(); Java基础学习书籍推荐《Head First Java.第二版》： 可以说是我的 Java 启蒙书籍了，特别适合新手读当然也适合我们用来温故Java知识点。 《Java核心技术卷1+卷2》： 很棒的两本书，建议有点 Java 基础之后再读，介绍的还是比较深入的，非常推荐。 《Java编程思想(第4版)》： 这本书要常读，初学者可以快速概览，中等程序员可以深入看看 Java，老鸟还可以用之回顾 Java 的体系。这本书之所以厉害，因为它在无形中整合了设计模式，这本书之所以难读，也恰恰在于他对设计模式的整合是无形的。","tags":[{"name":"Java","slug":"Java","permalink":"https://zjxjwxk.com/tags/Java/"}]}]